{
	"EleutherAI/gpt-neo-1.3B": {
		"temp": {
			"0.1": [
				" a man was standing with his back to Niko. The man was tall and thin, with a long, narrow face and a long, thin nose. His eyes were a deep, dark brown, and his hair was a dirty brown. He wore",
				" was a young man with a long, thin nose and a pair of piercing blue eyes.\n\n\"You're Niko,\" the boy said, his voice a deep rumble. \"I'm Rufus.\"\n\n\"I'm Nik",
				" was a young man with a long, thin nose and a long, thin mouth. The man was dressed in a black coat and a pair of black pants. He was also wearing a pair of black boots. Niko's eyes widened as he recognized",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see the glint of a knife in his hand.\n\n\"You're a kobold, aren",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a young man, probably in his early twenties. Niko's eyes narrowed as he watched",
				" he watched as the butcher turned his attention to the chicken.\n\n\"You're a kobold,\" the butcher said, his voice a low rumble. \"You're a kobold, aren't you?\"\n\nNiko nodded",
				" a man was standing in the snow, his hands on his hips, his face a mixture of anger and fear.\n\n\"What are you doing here?\" Niko asked, his voice a low growl.\n\n\"I'm looking for",
				" was a young man with a long, thin nose and a long, thin mouth. He was dressed in a black coat and a pair of black boots. His hair was long and curly, and he had a pair of black eyes that were set in",
				" a man in a black cloak was staring at him.\n\n\"What are you doing here?\" Niko asked, his voice a low growl.\n\n\"I'm looking for a chicken,\" the man replied.\n\n\"I don",
				" a man was staring at him.\n\n\"What are you doing here?\" the man asked.\n\n\"I'm looking for a chicken,\" Niko replied.\n\n\"I don't have any chickens,\" the man said.\n\n"
			],
			"0.2": [
				" was a small boy with a large smile on his face.\n\n\"Hey, Niko,\" the boy said, \"I'm sorry I didn't see you earlier. I was busy with my friends.\"\n\n\"It's okay,\" Nik",
				" he saw the butcher's head turn as he heard the sound of a door opening. Niko's eyes widened as he saw the butcher's face turn red as he turned to face the kobold.\n\n\"You!\" Niko hissed",
				" he was now watching the butcher's back as he cut the bird into pieces.\n\n\"What are you doing?\" Niko asked, his voice a low growl.\n\nThe butcher turned to face him. \"I'm making a chicken",
				" a man stood with his back to Niko. The man was tall and thin, with a long, narrow face and a long nose. His hair was black and his eyes were blue. He wore a long coat that was made of a thick,",
				" was a large man with a long beard and a thick, black mustache. The man was dressed in a long, dark coat that was covered in a thick layer of dust. Niko's eyes widened as he recognized the man as the same one who",
				" was a man with a long, thin nose and a large, sharp nose. The man was dressed in a black cloak and a black hood, and he was holding a large knife in his hand.\n\n\"You're looking for a chicken?\"",
				" was a young man with a long, dark beard.\n\n\"You're Niko,\" the young man said, his voice a deep, gravelly rumble. \"I'm Yul. I'm a friend of Niko's. He",
				" a man was staring at him. Niko's eyes widened in surprise as he realized that the man was looking at him.\n\n\"You're Niko?\" the man asked, his voice a bit too loud for the cold.\n\n\"",
				" a tall, thin man with a long, thin nose and a long, thin mouth stood with his hands on his hips.\n\n\"You're late,\" the man said, his voice deep and raspy.\n\n\"I'm sorry",
				" was a young man in a black coat, a black hat, and a black cloak.\n\n\"I am the butcher,\" said the young man, \"and I have a special request for you.\"\n\n\"What is it?\" asked Nik"
			],
			"0.3": [
				" he was now facing the same man who had been cutting his last chicken.\n\n\"I'm sorry, but I can't help you,\" the man said, his voice low and gruff. \"I don't have time for this.\"\n",
				" a man in a filthy black cloak was staring at him. Niko's tail twitched nervously.\n\n\"You are looking for the chicken?\" asked the man.\n\n\"Yes,\" replied Niko.\n\n\"I don't know",
				" a man stood with his back to Niko. The man was tall, with a lean, muscular build. His black hair was cut short and his eyes were dark and piercing. He wore a long coat that was made of thick leather and a pair",
				" was a large, muscular man with a long beard and a large, bushy mustache. The man was dressed in a black robe and had a long, white beard. His face was covered with a thick layer of beard, which was trimmed to a",
				" a man was standing in the doorway.\n\n\"I'm looking for a chicken,\" Niko said.\n\n\"You're looking for a chicken?\" the man asked.\n\n\"Yes, I am.\"\n\n\"I don't",
				" was a girl with a long, dark braid that hung down her back.\n\n\"What are you doing here?\" Niko asked, his voice a harsh whisper.\n\n\"I'm looking for a chicken,\" she said, her voice",
				" a young man was staring at him. Niko's eyes widened in surprise. The young man was tall, with a lean, muscular build and a face that was both handsome and rugged. He was dressed in a simple black tunic and trousers,",
				" he was now watching the man's back as he hurriedly cut the bird into pieces.\n\n\"What's going on?\" Niko asked, his voice low and menacing.\n\nThe butcher turned around and looked at Niko. \"I",
				" was a young boy.\n\n\"You're a kobold, aren't you?\" the boy asked.\n\n\"Yes, I am,\" Niko replied.\n\n\"I'm called Kiki,\" the boy said. \"And",
				" a man in a long black coat and a black hat with a white feather on top was staring at Niko.\n\n\"What are you doing here?\" Niko asked.\n\n\"I'm looking for a chicken,\" the man said."
			],
			"0.4": [
				" was a young boy.\n\n\"Hey there,\" Niko said, his voice low and soft. \"What's your name?\"\n\n\"My name is...Alfred,\" the boy said. \"I'm a little lost.\"\n",
				" was a young man with a dirty, torn coat that hung loosely around his thin frame. A large, black, leather-bound book lay open on the ground next to him. Niko's eyes narrowed as he studied the young man. He was",
				" was a man with a long, dark beard. The man's eyes were wide and his mouth was open in a silent scream. Niko's eyes narrowed in suspicion.\n\n\"Niko!\" the man screamed.\n\nNiko turned his",
				" was a familiar figure.\n\n\"Hello, Niko,\" said a voice that sounded like a cross between a cat and a dog. \"I hope you're not hungry.\"\n\nNiko lowered his head and made a face. \"I",
				" a young boy was sitting on the ground, his face and arms covered in blood.\n\n\"What happened?\" asked Niko, his voice echoing in the alley.\n\n\"A chicken,\" answered the boy, his voice a little shaky.",
				" a man in a red cloak and apron was staring at him with a look of disgust on his face.\n\n\"What are you doing here?\" the man asked, his voice full of contempt. \"I thought you were in the city.\"",
				" a young man with a long black beard and a long, bony nose was staring at Niko. Niko's eyes widened as the man walked over to him and spoke to him in a low voice.\n\n\"You are a kob",
				" was a man in a dark cloak. Niko's eyes widened as he recognized the man as the same one who had been stalking him all day.\n\n\"Niko, I'm so glad you're here,\" said the man, \"I",
				" he watched the butcher's back as he moved back and forth on his stool, his long knife moving in a slow, steady rhythm. The butcher's back was covered with a thick layer of snow and the man was clearly in a hurry. Niko",
				" was a man with a long beard and a large nose. The man was dressed in a long coat and a pair of heavy boots.\n\n\"Hey there, little kobold,\" said the man. \"I'm looking for a chicken.\""
			],
			"0.5": [
				" a tall man with a beard and dark eyes appeared. The man's face was hidden behind a hooded cloak, but Niko could see his eyes peering through the folds.\n\n\"I'm Niko, the kobold,\" the",
				" he was a perfect target. The butcher had not been paying attention to the kobold, but the kobold had been paying attention to the butcher. The butcher had simply been too busy to notice. A small piece of kobold flesh",
				" a man was rubbing his hands together.\n\n\"I am looking for a chicken,\" Niko said, trying to sound as casual as possible.\n\n\"A chicken?\" the butcher said, his eyebrows rising. \"You don't have a",
				" he watched the butcher's face as he slowly lowered the knife and turned to face him.\n\n\"You're a kobold, aren't you?\" Niko asked.\n\nThe butcher glanced up at him, his eyes glowing with a",
				" a man in a dark coat and a large hat was speaking to the kobold. Niko froze, not sure what to do. The man's voice was calm and he didn't look at Niko as he spoke. The man's voice",
				" a small figure leaned against the wall, its face covered in a mask.\n\n\"Niko, you're late,\" said the voice of the masked man.\n\n\"I'm sorry, I didn't see you there.\"\n\n\"",
				" was an old woman with a long white beard. The woman looked at Niko and smiled.\n\n\"How's it going, little one?\" she asked.\n\nNiko looked at the woman. She was a very old woman, with",
				" a young man in a blue uniform was running his hands over the carcass, then rubbing the flesh between his fingers.\n\n\"You're a good boy, aren't you?\" the young man asked, looking up at Niko.\n\n",
				" was a young man who had to be no more than twelve years old. He had dark hair and a dark beard that hung to his waist. His eyes were dark, too, but the pupils were small and round. He was wearing a long,",
				" a large black cat with a white mane and tail sat on its haunches, watching the kobold with a beady eye.\n\n\"You're a good kobold,\" said the cat, its voice"
			],
			"0.6": [
				" a short, stocky man with a long gray beard was staring at him.\n\n\"Good afternoon,\" Niko said. \"I'm looking for a chicken.\"\n\nThe man's eyes widened, and he began to turn away. \"",
				" was a girl. She was about his age, maybe a bit younger, and she was dressed in rags, but she still had the face of a woman. Her body was thin and her hair was cut in a short, uneven style. She",
				" was a familiar figure.\n\n\"You know you can't catch a kobold with your scaly tail,\" the man said.\n\n\"I know, but I still want to eat it.\"",
				" a man was staring at him.\n\n\"What's your name, sir?\" Niko asked in a low voice.\n\n\"I'm Janson, kobold.\" The man spoke with a slight accent.\n\n\"What do",
				" was a girl.\n\nNiko stood up straight, his tail whipping in the wind as he tried to determine who the girl was.\n\n'What is it?' Niko asked, his voice sounding as if it had been raised to a",
				" was a man dressed in a dark cloak and a hood. The hood was pulled tight over his face, revealing a pair of wide, slitted eyes, a thin nose and the beginnings of a black beard.\n\n\"You're late,\" the",
				" an enormous brown kobold was gazing down at Niko.\n\nNiko's eyes narrowed. He knew that kobolds were very powerful and dangerous creatures. But he had never met one before. He wasn't going",
				" the kobold was now using his tail to rake the snow and dirt into a mound. As the snow covered his fur, it was easy to see that he was angry.\n\nKobolds were notoriously quick and agile. The only thing",
				" a man in a black cloak with a red cape stood on the other side of the alley, watching him with an empty eye socket.\n\n\"You're not looking for the chicken?\" Niko asked.\n\n\"Yes, I am.\"",
				" a brown-haired, muscular boy with a wicked grin, stood a girl with bright red eyes and big teeth. She was holding a large butcher knife in one hand, as if she were going to cut up her own chicken.\n\nNiko"
			],
			"0.7": [
				" a man stood and looked up at Niko. Niko could see the man's face clearly now, and it was a familiar face.\n\n\"Ah,\" said the man. \"I was hoping you would come by and get your chicken.\"",
				" the butcher's eyes met Niko's. He lifted his head, too, and looked at Niko with a smile. Niko's smile faded.\n\n\"You're being watched,\" Niko said in a low voice.\n\n\"",
				" a large bald man was staring down at him.\n\nNiko stood still and tried to remain as still as he could. He didn't want to make the mistake of moving too quickly and being caught by the bald man. It was a mistake",
				" there was an open sack of grain, which he knew to be stolen from the butcher's stall by one of the vendors. The vendor had taken the grain and thrown it down the alley while the butcher had been busy with his customers. But Niko",
				" he could hear the shuffling of footsteps. Niko couldn't see who was approaching, but he knew it wasn't the butcher.\n\nNiko glanced over his shoulder. \"What do you think you're doing?\" he asked.\n\n",
				" was a man in a hooded cloak. Niko could only make out the outline of the hooded man's face through the flapping cloak. But he knew he had to move fast. He turned his head to the left and quickly made his",
				" two men were glaring at him. The man closest to Niko was a short, middle-aged man with a wild, red beard and a scar that ran from the corner of his left eye to his upper lip. He was also wearing a long",
				" Niko was just in time to see the animal's head roll to one side. The butcher was lurching around, trying to get his meat back into the stall, but he was unable to control his movements. He looked up, startled,",
				" was a familiar figure. The thief was wearing a hooded cloak and boots. The only thing that seemed different about the man was his long black hair, which was parted in the middle and tied in a tight ponytail. He was dressed in a",
				" his tail twitching, was a large wolf. The wolf snarled and hissed at the kobold, who stared up at him in horror.\n\n\"Who are you?\" Niko asked.\n\n\"I am called Wolf"
			],
			"0.8": [
				" his small scaly body was covered with white dust. The whole city must have smelled like chicken for a minute or two.\n\nThe butcher turned his head and saw Niko and his bulging scaly body. Niko's bulging sc",
				" was a tall and attractive young woman, who looked to be in her early twenties. The beautiful young woman looked to be in her mid-twenties, but her eyes were darker than Niko had ever seen before. A small triangle of black",
				" a pair of eyes watched him from the shadows of the alley. Niko hesitated for a moment, then carefully stood up, leaving a small cloud of dust behind him as he moved towards the shop. He was close enough to hear the man's voice",
				" a dark, bony face appeared. Niko was not fooled by its appearance and quickly raised his claws to his mouth. His eyes twinkled as he remembered the day that he had been trained to be an assassin. He smiled to himself and",
				" an old man with a white beard was holding up the bird with one hand and holding up his other hand to help the kobold up with the other. The butcher looked up at the new arrival with a puzzled expression, but the old man seemed",
				" he was suddenly aware of something. Something that reminded him of the one time he had seen this same kobold and another kobold.\n\n\"Whoa!\" Niko laughed nervously. He had not known that the other kobold",
				" he felt a sharp pain as he heard a small explosion.\n\nThe kobold blinked, and then blinked again.\n\n\"Who are you?\" the butcher asked.\n\n\"Niko,\" Niko answered. \"I'm from",
				" was a tall, muscular man who held up his right hand and smiled at Niko, as if to say, \"Come over here and I'll take you to the chicken.\"\n\nThe man reached out his hand to Niko, who hesitated",
				" was a woman in her thirties with long blonde hair and wearing a simple cotton dress that was stained with blood. A blood-stained dress. She looked like she had just come from the morgue.\n\n\"Who are you?\" Nik",
				" he reached out and took hold of the chicken, then let it fall to the ground. Satisfied that the chicken had fallen into the stall, he stood up and headed back to the alley.\n\n\"Are you alright?\" asked Aiden."
			],
			"0.9": [
				" was the redoubtable Kiki, a demon of darkness that Niko had seen a number of times before.\n\n\"What's wrong?\" Niko asked, his eyes darting around as he listened for any movement in the shadows.\n",
				" he stared intently at the pale eyes of the hapless beast before reaching out and gripping it by its neck.\n\n\"The crow could have eaten the chicken,\" Niko thought, \"but I still might have taken it.\"\n\nN",
				" a group of kobolds stood watching him. Not that Niko cared. He had all he needed and he had come all the way here just to steal the bird.\n\nSuddenly the alleyway was filled with a heavy thud. Not",
				" was a very large, very muscular man who was clearly the type to rob him.\n\nThe man held up his hand and yelled at Niko. \"What the...?\" Niko turned to see who had interrupted him. The man had on",
				" the red-clawed butcher was busy with the knife, his hands held up as if in supplication. Niko crept closer to the door of the stall, eager to see what he could do to get the butcher to turn his attention away from",
				" he surveyed the area. It was as quiet as could be and as cold as could be. Where did all the people go during the winter? It seemed to Niko that they went nowhere. The closer he got to the stall, the more he",
				" a young woman wearing a peasant's outfit, sat with a bowl of vegetables, a jug of water, and a large stick that dangled from her hand. She was only a few years older than Niko, but she had a refined and sens",
				" he stared in surprise at the young man who had just entered the shop.\n\n\"How did you know I was here?\" Niko asked, squinting his round, red-orange eyes up at the young man.\n\nThe young",
				" was a young woman, probably in her early twenties, wearing an expensive coat and trousers, a stiff collar and a crisp white cravat. Niko smiled at the girl. She wasn't much older than him, maybe a year or two younger",
				" a muscular man stood staring at Niko, his face scrunched up in concentration. Niko suddenly realized what was going on. The man was doing his job, just like everyone else. The man was just like them.\n\n\"Well"
			],
			"1.0": [
				" he examined his small target. Niko held up his scaly hand and pointed to the ground. \"There!\" he cried out.\n\nThe butcher looked up and squinted his eyes against the bright winter sun. \"Well, yes,",
				" was another kobold with a smaller scaly body, but larger eyes. The kobold smiled warmly at Niko, and Niko looked up in surprise.\n\n\"Ah, Niko,\" the kobold said, dropping",
				" he snuffled and licked his lips in an attempt to appear more appetizing than he was.\n\nThe butcher raised an eyebrow at Niko, but before he could say anything he heard a raucous squawk from nearby. Nik",
				" he could see the body of the slain chicken. Even as the butcher moved away from the stall, he watched as the chicken flew to the ground.\n\n\"Fool,\" he muttered. \"I am too slow. If I had thought of",
				" the magical piece of meat sat like a lump of dark wood in the pale dust of the cobblestones. With a small twitch of his beak, Niko flew into the alley and disappeared into the night.\n\n\"Wow, that was",
				" he took a cautious step forward.\n\n\"Who is it?\" the butcher's voice came out of the shadows.\n\n\"Niko,\" said Niko, walking up to the stall.\n\nThe butcher eyed Niko warily as",
				" stood the stonework man who'd brought the meat home. Niko's sharp, barbed tail twitched in agitation.\n\n\"Pardon me, miss,\" he mumbled. \"Could you have a look at this chicken, please",
				" was an enormous man with his arms full of golden chickens. The man stared back at Niko with his glazed, yet surprisingly impassive eyes, his piercing stare reminding Niko of a mountain lion stalking its prey. As the kobold",
				" was a man in a long coat, thick hat and scarf. He looked at Niko and moved a few paces away from the stall. A peculiar smile on his face made Niko wary.\n\n\"Your winged friend doesn't know",
				" his scales gleaming in the light of the streetlamps, was a creature with hair the color of mocha and eyes that were the color of chocolate. Niko was prepared for his surprise and took a step forward to meet the kob"
			],
			"1.1": [
				" was a mysterious, big-eyed old man.\n\n\"How many chickens do you have?\" asked Niko, giving him the side of his chicken, the shiny black skin almost melting in the low winter sun.\n\nThe",
				" Niko saw something very peculiar.\n\n\"What's wrong, Niko?\" called out a voice. Niko looked around, unsure what the voice was referring to. It was a sharp little kobold that appeared to have gotten a bit",
				" was a dark shadow. He turned to see who had caused the disturbance. Standing behind the hooded figure, was a giant man with ice-blue eyes. The moon was hidden by the clouds but he was clearly visible to the thief, as he",
				" his gaze scanned the street. Niko didn't bother to look up. He simply knew what he was going to do.\n\nSwinging his clawed right arm to his back, Niko jumped off the cobblestones and leaped",
				" there was a girl. She looked about twelve, with a snub nose and dark hair swept back from her face. She was holding a wad of old rags in her hands. She had an expression of terror on her face.\n\n",
				" a trio of pale, ghostly figures appeared out of thin air. A human form, but a young one, which Niko took to be two young humans. He dropped his head and began to squawk and hide his ears in case anyone was",
				" a muscular man held the half-full basket of meat between his hands and stared at Niko with a serious expression.\n\n\"Look, little worm, I haven't got much time. The store is closing soon and the food has been ordered",
				" a muscular black man appeared to take notice of his visitor.\n\nThe new customer held out a meaty paw to get Niko's attention, but his words were drowned out by the lonesome moaning that arose from the corner. The sound",
				" his gaze scanned the alley, his pink eyes scanning every nook and cranny for a place to hide. No sooner had he spotted a bush than he pushed it aside, jumping out of the way with a yell of pain as his wing was torn",
				" a small boy, wearing an undersized brown leather jacket and his plaid shirt, stepped out of the shadows.\n\n\"Hello, my little darlings!\" The butcher smiled warmly.\n\nNiko yipped with excitement. He"
			],
			"1.2": [
				" a fat pig-faced old man stared back at Niko with those same round piggy eyes that Niko had noticed from his first day on this continent. It took no great amount of intelligence to realise that the man was neither that old nor that",
				" an old woman was watching the stall with curious eyes. \"Oh dear,\" she sighed, \"the kobolds will not leave him alone! They want to steal his food.\" She peered over the small stall,",
				" the crow flew up and vanished into the gray clouds above. He had done it! He had spotted the cart and stolen the chicken! His secret plan was in full swing. He just needed a bit of time. But how long would that be?",
				" he raised his head to see what had caused the loud thud. The yellow eyes stared straight into his.\n\n\"Dwarf,\" he growled, \"I am what you call a dwarf. Do you not have",
				" he looked around for a minute before he spotted his prey. He made his way to the other side of the alley and continued his search. It took him another half-hour to find his chicken and grab it before he returned to the street and went",
				" an army of nearly three dozen robotic chickens burst out of nowhere. Flapping their wings and tossing their heads, they ran through the snow to chase Niko down. The army was led by a maddened rooster who bellowed and snapped his",
				" he knew what had to be done.\n\n\"I'll take care of it.\"\n\nTaking off his black cape, he raised his long tail and glided over to the butcher. \"This chicken is mine",
				" stood an ancient soldier.\n\n\"Yoshi!\" the kobold called out as he watched the soldier's back being pressed up against the fence. \"Hey, hey, what are you doing here?\" the old man repeated with a deep sigh",
				" he stared at the figure in the same way that they had stared at the two men earlier. Their gaze was aimed at the meaty meat on the carcass, but their expressions were innocent and the only question that Niko was expecting was the correct",
				" an old man with white hair and a red beard, a man with no great education, watched the entire operation with an expression of incredulity.\n\n\"This is ridiculous,\" Niko said. \"I'll have to go back home.\""
			],
			"1.3": [
				" the only thing that remained of the golden-haired boy was his skin, rippling in the cold breeze that blew from the side of the alley.\n\nThere were only three small shadows moving in the dark alley behind the kobold stall",
				" was a man who bore a resemblance to the storekeeper at Vittorion, although not in the kind of black clothing. Niko recognised the tall man from previous visits, even though he had left his bow and quiver on the ground before",
				" he let his tail go limp and dropped the chicken onto the ground, right where it lay. It was nearly dead.\n\n\"Where's your master?\" the red-cloaked villain whispered as he squatted down beside the animal. The",
				" he waited for his prey to approach. \"Fool!\" he said, yanking the hood back. He caught sight of a woman coming towards him, her cheeks rosy from the cold, her dark eyes gleaming in the torchlight. She",
				" a figure stood waiting patiently.\n\n\"What do you want?\" Niko growled, feeling his tail begin to twitch. He licked his chops to rid them of the grease, his long bony tail twitching in anger. \"Do",
				" a dark-haired woman stepped out of the shadows.\n\nShe was so young, and her large eyes seemed to glow in the winter cold. She was dressed in plain black clothing that clung loosely to her form, her shoulders and arms were",
				" he watched in astonishment as the lad carefully pulled out the roasting bird, still unaltered, with no need for a knife to slice the thick skin. The fresh meat, completely still, glistened with a patina of grease and",
				" he studied the wall that stood between the stall and the wall. His scaly hide fluttered with nervousness, making him almost stand on his hind legs, ready to spring at the slightest sound. The sudden sound caused him to lose his balance,",
				" he spotted an excited boy running toward him with a strange object in his hand.\n\n\"I have found the chicken, Master,\" the boy shouted, pulling a thin sheet of paper out of his pocket.\n\n\"Did you find it?",
				" stood a man in a white shirt and grey slacks, wearing a simple brown leather vest and carrying a rusty axe. He wore no hat or scarf, and the little straw hat that fell onto his head gave him an almost bovine appearance."
			],
			"1.4": [
				" he pressed his cheek to the side of the opening and peered into the dark corner of the alley. A nearby boy, perhaps fifteen years old, who had fallen asleep had snored loudly, and now, when he suddenly sat upright, a crow",
				" was a man with black hair that hung almost to his shoulders. He was clearly in his early twenties, a pleasant, fair-haired youth who looked to be of low class. He held a thick branch with a decorative silver feather hanging from it.",
				" a gaunt, wrinkled man with a scraggly beard stood with his arms crossed. He stared back with cold determination.\n\nNiko tried to read the man's face, but he appeared completely uninterested. He reached down to grab",
				" the shopkeeper watched the pair of little wolvins snatching a piece of meat. A deep voice rumbled across the frozen alley.\n\n\"How about it?\" a second voice rumbled back.\n\n\"",
				" was a stranger. Niko could see a bloodstained mask before his eyes.\n\nA bloodied shadow passed over the empty stall and watched him carefully as Niko backed up. \"I have to go.\" He turned to leave and heard someone",
				" was one of his brother. Niko's body suddenly tensed as his thoughts began to drift to the next step in his plan. He stood still as his eyes turned to follow the brothers. The shadow they cast over the alleyway made it difficult",
				" he pressed his body flat against the walls and sniffed the air. Then, drawing in a deep breath, he slid over the wooden boards until his back rested against the same wooden slats that covered the bottom of the stall. He lowered his tail",
				" he casually stretched out his back and spread his claws as if waiting for someone to come along. Then, as he prepared to climb onto the counter to remove the last shreds of meat, Niko gave a loud yip and spun about in his",
				" an elderly woman was lying on her side with her head on a stack of other customers. She was also covered in bloody meat.\n\nIt took all of Niko's concentration to hide his fear of the powerful human woman who had hurt the k",
				" Niko turned to see the newcomer eyeing the chicken suspiciously. His eyes lit up as he recognized his victim, the rare creature that had lured him into this hole in the alleyway. His name was Guild, the kobold from Thal"
			],
			"1.5": [
				" he raised his scaly head to look around.\n\n\"What's that?\" someone called from behind Niko.\n\nNiko immediately rose to his feet and began to retreat. The fat butcher approached Niko cautiously, knowing that his customer",
				" was a huge red lizard. Niko was a small red kobold, barely large enough to hold a scale. Yet the giant kobold was bigger than any normal human being. Its hide was an eerie pink, its long claws a glowing",
				" a man had casually leaned against the building, oblivious to the kobold stalking him. Niko slowly walked over to the shop, making sure that the person was in no way looking at him before going to open the door.\n\nThe propriet",
				" a cloaked figure sat in a filthy cloak with a round hat on his head and eyes so large that they appeared to peer through the dirty snow as he lifted the chicken into the air. \"Do you see him?\" asked the person, sounding slightly nervous",
				" was a girl with eyes of pale green that were shadowed with age.\n\n\"Mister!\" she called to the tiny man.\n\n\"Yes, ma'am?\"\n\n\"Where did",
				" Niko could now see a cloaked figure moving about. The merchant, Mr. Jazusa, appeared to be buying the chicken for a later date. But that wasn't all. The cloaked man's next target was Niko himself.\n",
				" a middle-aged woman peeked out from the shadows of her house and regarded him with suspicion.\n\n\"No one's looking, nothing to see here,\" Niko said loudly, his voice resonating through the little stone passage that led to",
				" he saw two smaller human figures moseying about. They both stopped as one looked up and caught sight of the giant black monster of a man who was approaching the chicken stall.\n\n\"Oh no you don't,\" said the large, armored",
				" a girl of around seventeen, clad in a little more than a dress, a cape and boots, raised her arm to cut off the rooster. Niko watched as the girl walked back to the street with the kobold. \"Oh well",
				" he quickly made his way over to the clump of weeds that grew near the entrance. It was easy to walk around and just get the bird by pecking the dirt out of the gutter. His confidence grew when he heard a noise from behind"
			],
			"1.6": [
				" was a girl. Niko had been around so much, he wasn't quite sure where she was. The chill of the day seemed to take him by surprise. Maybe it was just the novelty of having a pet who had already lived so long,",
				" the beast turned around slowly. At the sight of his silver body glinting in the dimly lit room, Niko growled.\n\n\"Wait, let me just find the right chicken, then you can go,\" said the merchant,",
				" he waited until he saw a gap in the clouds of white. Suddenly, a malevolent figure glided across the snow and hit him with a boot.\n\nNiko cried out and leapt back, turning his head to see who had landed on",
				" the tigress waited patiently as the beast worked on the bird. The woman was as well known as any tigress in Acheron, if not the whole region, but still she wasn't doing much to tempt fate. She was as",
				" stood a shadow that only Niko recognized as him. With a tsk, he turned his attention to his friend. \"Oh no, oh no,\" Niko thought as his hands quickly formed a large 'X' over his right shoulder.\n",
				" a tall, bald man stood at the end of the alley. A curious expression was stamped on his face as he gazed up at Niko, and Niko's claws pricked as he came closer.\n\n\"Excuse me, I'm",
				" Niko snuck a quick look at the city as he continued down the alley. It was strange to see such an obviously wealthy and well-known city street now with all the poverty, the crack houses, and the huge pit-shocked corpses",
				" there was no doubt that the chicken was missing.\n\n\"What's going on here?\" asked a man in a dirty white apron, brushing his sleeves down his chest. \"My backside is numb from scraping ice off the cobblestones",
				" his head nearly poking through the cage, was a jovial looking, young, peasant girl.\n\nThe redheaded kobold pushed his cloak out of the way, flicking his tail to clear a path, and trotted up to",
				" Niko was easily seen through the folds of his cloak. \"Go get the chicken.\"\n\nThe cart rattled across the cobblestones as the cold wind blew the small pile of feathers in the center of the stall. In a move that seemed"
			],
			"1.7": [
				" was an open manhole cover. A dim figure clad in jeans and a fleece vest could easily slip through it and walk away with the chicken, unless someone happened to be looking out.\n\nNiko thought for a moment. He watched the",
				" a second silhouette glided out of the shadows and slithered past Niko, taking his place as he hid himself from view. A very tiny silhouette at that. In reality it was the mite that looked like the butcher, but rather than look",
				" a young woman approached and raised her hand to greet Niko. Niko returned her greeting, curious to see what this unknown individual might be doing. She had long brown hair and brown eyes that flashed a bright smile as she moved closer to the little",
				" his glowing eyes lit up in an angry glare.\n\n\"What is it, Kako?\" Niko asked softly.\n\n\"You stupid worm,\" Kako snarled. \"Who gave you the idea to talk to me? You",
				" was a woman with long red hair. Niko grinned, imagining how easy it would be to get her. \"You there!\" Niko hissed. The woman jumped slightly and turned to look at him, a knowing smirk pl",
				" he took aim and fired. The stench of gunpowder and singed flesh made the hairs on Niko's back stand up. When the butcher threw up a hand to his nose and let out a disgusted gasp, Niko pulled the trigger again",
				" Niko made sure to appear as small as possible in order to cause maximum embarrassment.\n\n\"Bruin.\" The woman with the blonde hair, trying to get closer to Niko so that she could peck him on the cheek. \"",
				" a kobold woman approached with a little tray of soft cheese, black pepper, a sharpening stone, and some charcoal.\n\n\"Oh, good morning,\" she said.\n\nNiko sat down on the corner of the cobbl",
				" a thick gray curtain separated the kobold's small sanctuary from the curious crowd that filled the street.\n\n\"Do you see that fellow?\" a red-cloaked shadowed figure cried out in wonder. \"That's Shoggz",
				" the corner of his hood shifted as his head turned, the rustling of his hood having some people dropping glances on him. He looked around the area. What he saw caused his tail to curl upward, the blood on the meat that he was holding"
			],
			"1.8": [
				" was one of the wretches who had been hired by him and a certain strong woman to come to him in the afternoon to keep watch on his business. She had her hands shoved deep into her blouse, her breathing hard, her lips pulled",
				" his cold eyes were no longer averted, and his breathing was no longer low. His muscles were rippling beneath his pale skin, making him seem much more impressive than he was. His small ears twitched at the noise Niko was making",
				" he saw something small move. Was it his brother? And, judging by the way the youth had been behaving lately, it seemed likely. It was hard to tell from the dust on his face and the strange and familiar smell that was hanging around him",
				" an unseen pair of feet had trampled through the mud and snow that coated the ground. The blade of a pickaxe had been thrust through the belly of a bird lying at his feet. Not too much further along the street a younger man was hacking",
				" a grinning face loomed out of the darkness. Niko lifted his nose and sniffed the air. The first sight that met his eyes made him raise his snout, his gaze fastened on the smile that sat just a few feet away.",
				" an arm slowly emerged from the sleeves of a dirty gray cloak. In one hand the cold thing held a stone, the edge sharp as a blade. It was still razor sharp. It slashed at Niko's breast, forcing him to flinch and",
				" was a slim, but well-built young man with brown hair that glistened in the dark winter morning light. Niko's eyes shifted in the direction of the young man. They focused on him, waiting for an invitation to approach.\n",
				" Niko looked up and his scaly body went into motion, swiping his talons down the length of the barrel and gripping the chicken in his paws. In an instant, he pulled it from the chest of the butcher. \"The feast is",
				" he had seen what looked like a silver whistle flying in the air, moving away from the other butcher. This, he decided, was not the correct time to interfere with a man of the law. Besides, he knew better than to make a spectacle",
				" a grinning killer named Gregor used his horn to scream, \"Gut and Fowl!\" Niko twisted around and rushed at the kobold, using his fangs to force his opponent to release the chicken. Then he waited"
			],
			"1.9": [
				" he reached out with his front legs to stroke a tatty rose-bush.\n\n\"Get lost!\" The startled bird dropped on the ground and looked around, only to realize that Niko was staring back at him. With a fluttering",
				" a jaunty face appeared in the opening. A pale girl in the now-cold wind waved a friendly smile at Niko, but before he could say anything, her hands grasped his and pushed him out the shop's front door. Niko",
				" he stared hard into the stranger's blue eyes.\n\n\"I've seen you before, lad. Where have you been?\" Niko said quietly.\n\n\"What are you doing here?\" The stranger asked with his old cocky attitude back",
				" the local hangman bent down and started rummaging through the disused cutlery drawer.\n\nHis sudden appearance startled Niko and made him look up to see the local hangman frowning at the door of his hideout. A",
				" was a giant scorpion!\n\nAnd then Niko noticed that it wasn't just any old scorpion; it was one of the scorpions from beneath his sandals! At least that was what he thought at first. \"Well, it",
				" he cast his spell, pulling a shining golden ring into existence. Niko now stood just outside of the shop. He nodded and opened his tiny eyes, causing his gold gaze to sparkle.\n\n\"You have reached the darkest parts of hell",
				" he caught sight of a young boy perched precariously on the wall. Niko had seen children with chickens like that before and they were usually on their way to slaughter. This child looked to be a nice enough child, maybe even more so,",
				" he grabbed a small carved stone, now growing bigger by the second. Not only was it a good weight, but it had some of the fastest walking speed that Niko could muster.\n\nHe lifted the stone, cocked his arm back,",
				" the second dwarf drew his rapier and the fowl vanished from the table in front of Niko's feet. The stunned kobold whipped around, snarling at the brute. \"I didn't mean to...,\" he began,",
				" his arm raised in the air as if he was giving an impromptu speech, was an ordinary young boy who had lost his favorite pig.\n\n'Get away!' Niko yelled as he thrust his tongue out and poked the boy in the stomach"
			],
			"2.0": [
				" his scaly green face smiled widely, displaying his yellowish fangs and black eyes.\n\n\"Niko, what a good friend you are,\" the small animal said as he peered at Niko, scratching his long whiskers as he",
				" stood three figures in fine uniforms and civilian clothes.\n\n\"This way,\" one of the guards called out to Niko.\n\nThe kobold immediately scampered into the cold and dense winter air to join the group. As he began",
				" a very familiar figure loomed in the corner of the stall.\n\nThe man standing before Niko was indeed a thief. It was one that was commonly called the windshear or an ivory cobra, though the term ‘cob",
				" the coldness of the snowy ground suddenly seeped into his senses, and he was once again the same ugly, squashed little rodent he had been all those weeks ago. A glance around the alley told him that he wasn't alone",
				" the white snow that covered the ground began to swirl around him as he continued to look for his next meal. When the top of his cloak reached the hilt of his dagger, Niko didn't move. If he was ever going to escape the",
				" stood three rabbits, three massive golden-colored bunnies that took up most of the wall space in front of Niko. They blinked their big dark eyes at him and twitched their noses at him. Niko, however, just smiled and",
				" he could see nothing but an empty cloth and the thick swath of freshly sliced dark meat between his tail and the ground. All that he needed to do was to move the carcass to his resting place, collect his two dozen pelfs, and",
				" his leathery body swishing along the wall of cobblestones, was the imposing villain that the cobblestone traders had recently arrested for their involvement in the failed run.\n\n\"Hoi!\" shouted Niko as he stepped",
				" was an extremely familiar looking horse. His smooth gray coat and golden eyes provided an ideal camouflage as he observed the frightened kobold's dilemma. \"Please, I'll only take your money, but I need this chicken.\"\n\nThe drow",
				" Niko growled softly.\n\n\"Huh,\" muttered Niko. He'd already noticed a similar sort of dog patrolling the area before. One that moved with purpose, and the only person he'd encountered that day had been so blinded by greed"
			]
		},
		"top_k": {
			"0.5": [
				" was another kobold.\n\nKobold never spoke unless he had something to say. This one had been huddled under the stall's eaves for the past few hours, his cloak being soaked with rainwater, his brown skin",
				" was a tall man with black hair and pale blue eyes.\n\n\"Who is that?\" Niko asked, raising his voice so that he could be heard over the other two vendors.\n\n\"That is my man, Darkstream.\" The",
				" was a young boy wearing a clean, well-pressed shirt and brown trousers.\n\n\"Can I help you?\" asked Niko, his voice muffled by his large, misshapen body.\n\n\"Yes,",
				" was a soldier, who was frozen in place. Niko froze too, waiting for him to move and to fall over dead. \"It's all right, old man,\" said Niko, crouching to help him back to his feet. \"",
				" a man dressed in black stood behind the door. Niko noticed that the man had an expression of fear.\n\nNiko decided that the best thing to do was to move quickly, to the slaughterhouse, and then find the courage to enter",
				" an enormous clod of snow slowly fell to the cobblestones. \"Don't you think we should take care of that? A few shovelfuls might tip the scales.\"\n\n\"Your mother would never let you do such a thing,\"",
				" a bulky man with long brown hair stood and squatted before him.\n\n\"Why the hell are you in the middle of the street? I told you to be at the sea.\" The large, almost fully bald man in brown approached Niko",
				" he grinned, \"I smell blood.\" Niko stood and began walking slowly toward the butcher.\n\nThe butcher had just finished the chicken's breast and legs, and was running the carcass under a small flat pan. \"What is it?\"",
				" a man, a woman, and a small child had come out to buy the bird. Niko turned his head to the right and saw the man who had been the previous victim; he couldn't help but feel sorry for the little kobold",
				" an old man dressed in a battered brown coat and with a gray goatee stood and stared at the crow. Niko tried to maintain his composure, but the look of fear in the man's eyes gave him pause.\n\n\"I'm"
			],
			"0.55": [
				" was another kobold who hadn't seen him yet.\n\n\"There's someone standing there,\" said the kobold. \"Who is it?\"\n\nNiko stopped, looked at the kobold and smiled.\n\n\"",
				" he was a distant silhouette against the brown stone of the alley. Niko didn't like that.\n\nThe soft thud was followed by a muffled curse from behind him. Shaking his head, Niko turned to see what the noise",
				" was a strange man who looked familiar. Niko stared at the stranger with curiosity, then slowly lowered his eyes. He slowly stood up, moving as if his stiff muscles were stiff, and slowly turned to face the man. \"What do you want",
				" was another chicken. It lay on its back, spread out and unmoving, waiting for its dinner.\n\n\"Come on now, kobold,\" Niko said as he drew close enough to smell the chicken. He wanted",
				" was a tall, slender young woman with short, straight hair and large green eyes.\n\n\"You're very late,\" said the butcher.\n\n\"That's why you're late,�",
				" was a trio of dwarfs.\n\n\"I've got an idea!\" cried one of the dwarves, twirling a wicked-looking dagger in one hand.\n\nNiko dropped his head, his scaly body curling as he prepared",
				" he noticed the scent of onions rising from the carcass. It was enough to make Niko set his tail to the side and walk slowly toward the back of the stall. Before the door opened, Niko spotted the butcher move aside as if someone",
				" he spotted the girl. Niko watched her waddle out from behind the bar and then disappear into the snow.\n\nThere was no doubt about the girl's identity, but Niko wasn't about to be the first person to mistake her for",
				" was a large pack of four wolves. Niko's heart pounded. The wolves moved into the stall and stood beside the slaughtering stall. The three kobolds were as surprised as Niko was at the sight of the wolves.\n\n\"",
				" he watched as a sudden blur of motion sent the chicken flying into the air. The butcher's eyes widened in surprise as the chicken careened toward him. \"You can't get away with this!\" Niko growled, watching as the kob"
			],
			"0.6": [
				" he was about to make a run for it when the door flew open and a grinning ape leaped out, bearing down on Niko and his chicken, while a quartet of wicked, large, brown-skinned monkeys shrieked with delight.",
				" two empty cages hung precariously over the filthy window of the stall.\n\nAs Niko stood there and watched, the cold wind caught the pile of feathers on the floor of the cage. In a heartbeat, the cage crashed to the ground",
				" a small cart was empty. There was nothing but the kobold, his tiny body silhouetted against the dark shadows of the alley.\n\nNiko lowered his head to the cobblestones and looked around. For a moment, he",
				" a ragged little man lay prone on the cobblestones, his face streaked with blood. Niko ran to the little man, lifting him gently onto his shoulder, his clawed hands still clutching the poor, maimed little kob",
				" he watched in confusion as the chicken fell to the ground. Niko's ears flicked forward, turning in unison with his hind feet. The small cat pounced and clawed at the butcher's stomach, tearing out his heart. A wave of",
				" a small kobold had cut the chicken into smaller pieces and placed them on a piece of cloth. All that was missing was a few scraps of skin and bones, and Niko would be able to fit it all into his inventory. He would",
				" was a woman who was not nearly as beautiful as Niko had imagined her to be. She wore a red dress and carried a short knife.\n\nNiko stood up and stared in awe at the woman, who was about to emerge from the",
				" the other kobolds seemed to have grown used to the cold and were shivering.\n\n\"I am Niko,\" he said. \"I am the smallest of the kobolds.\" He waved his broad, flat, clawed feet",
				" was a tall man in a hooded cloak. The butcher had given up, resigned himself to being discovered. Niko had no doubt that the hooded man was none other than The Master of this hidden shop.\n\nThe Master smiled wickedly",
				" a masked man walked slowly down the alley toward Niko. The thought of a monster slinking through the shadows scared Niko so badly that he was almost hyperventilating when the man entered the alley. The man was dressed in a black cloak"
			],
			"0.65": [
				" a figure was working the knife with a small pointed object held in one hand. In a voice that seemed to come from far away, the tiny creature shouted out, \"Raa-roaaa! Raa-roaaa!\"\n\nA cold",
				" was one of those fine looking harp-shaped objects that looked like they had been fashioned from the entire carcass of a red-faced monster with a face as round as a pumpkin. Niko could only see a few meters away. All that",
				" a small woman in her mid-twenties with dirty hair and rough skin stood behind the bar and held out a serving tray to Niko.\n\n\"That's him,\" she said. \"You should take a look.\"\n\nN",
				" stood three young men who all looked like they had just gotten off a mission to kill an invader and were determined to make a clean getaway. Niko ran to them, growling loudly as he swung his long, sharp talons at them",
				" he watched as the kobold climbed down the alley. He craned his neck to see if anyone was looking at him, but the street was deserted.\n\n\"Let me go!\" he shouted, straining his neck to get a better",
				" he raised his huge maw to reveal the dark meat nestled between his sharp teeth.\n\nA satisfied purr escaped Niko's throat. He was now certain that he was about to obtain his next meal. If not for his",
				" stood a woman with a spade. She was gazing at Niko as if he were the lost soul from an old Disney movie. The smell of chicken hung heavily in the air, and the sight of a kobold who was now content to",
				" was a fat-nosed dwarf in a stained and tattered cloak. \"Ah, well, you see,\" said the dwarf, shaking his head, \"that's the one we've been waiting for.\"\n\n\"How do you know?\"",
				" a small but powerful woman was staring at him.\n\nThe small woman had long, stringy black hair, thin and wispy, tied in a bun at the back of her head. Her face was dark, with a set of sharp",
				" was a man wearing a black cloak and carrying a heavy blade.\n\nThe man glanced up from his butcher's stall and made a face. Niko, however, had already noticed him.\n\n\"I see you've been stealing chickens,\""
			],
			"0.7": [
				" was a very surprised Red Ghost.\n\n\"What's the matter?\" Niko asked.\n\nThe Red Ghost had trouble answering. He was surprised, frightened, and confused. The sight of the kobold, so small, so beautiful",
				" an old woman was slumped over the carcass of a chicken, blood seeping out of her mouth and onto the ground.\n\nThe butcher walked over and looked down at her. His mouth opened in a scream of horror and the poor woman clut",
				" the guardsman was an imposing sight. It was apparent that the shopkeeper was a close friend of his and that he would try his best to please Niko.\n\n\"What is it?\" Niko whispered to himself as he continued to stalk",
				" a young boy emerged from the shadows of a nearby building. The boy stood quietly, his eyes never leaving Niko's massive body. Niko heard a soft clinking sound from behind him and looked back to see a coin disappear into his hand.",
				" he listened intently as the sound of hooves came from the direction of the butcher's shop.\n\nA man's voice called out to him from the alley, causing Niko to roll his eyes in annoyance.\n\n\"You stupid k",
				" his small brown body blocked out the light from the doorway, was a dark figure. It wasn't a stranger—just the man Niko had been waiting for.\n\nNiko snarled, ready to charge forward when the man stood still",
				" he was staring at a small dark cloud of dust billowing up from the floor. Niko hissed and pressed his tail against his flank, suddenly alert.\n\n\"What is it?\" asked the butcher.\n\nNiko was silent for",
				" an older woman appeared.\n\n\"Have you finished your chicken?\" she asked.\n\n\"Yes, madam,\" Niko answered.\n\n\"Then please go ahead and cut it up for me.\"\n\nNiko slowly backed away",
				" there was a small opening at the bottom of the alley. Niko stepped through the opening and quickly walked over to the basket where the chicken was wrapped in some sort of cloth. Niko then carefully lowered himself down onto the cloth so that he could",
				" a large dark shape emerged. Niko had a terrible suspicion that this thing was an escaped bird and he decided that he would have to find a way to bring it back.\n\n\"Do you have any idea where this chicken is?\" Niko"
			],
			"0.75": [
				" was a small dog that looked almost human in shape. Niko's eyes locked on to its tiny pink eyes. It barked at him and lunged toward him. Niko leapt out of the way and laughed as he ran through the snow,",
				" he turned and nodded to the two men who stood behind him.\n\n\"Come with me,\" said the butcher, as he picked up his basket and stepped toward the alley.\n\n\"Where?\" Niko called after him.\n\n\"",
				" a very large bald man with a crooked nose, was what appeared to be a massive kobold.\n\n\"Oh good!\" said Niko, his large red eyes flashing with excitement. \"I was just about to give",
				" the dead man's clothes were hanging loosely from his body. A small smear of blood was now visible on the front of his shirt. His body lay at an unnatural angle and the rest of his body was lying at an even greater unnatural angle. The",
				" he took in the scene before him.\n\nThe meat had already been plucked from the carcass and the skin removed, leaving behind the white bone-and-gut membrane that made up the main muscle mass of the bird. The meat",
				" stood a familiar young girl, her eyes big with curiosity.\n\n\"What do you want?\" she asked.\n\n\"What's your name?\" Niko inquired.\n\n\"I'm Teri, from before.\"\n\n\"I",
				" was a young woman. She stood beside a tall cart with a horse inside. The cart was plastered with advertising flyers and big white posters with the company's name, _Meiji Pizza,_ printed in bold, gold lettering. A poster",
				" a tiny girl was squalling and flapping her arms around.\n\nNiko rolled his eyes and stepped forward. \"You there, take this chicken and give it to the little miss. It's her own. She won't eat it unless",
				" was a tall man. Niko could hear the sound of a sword cutting through the snow as the man moved his sword closer to the stall. The butcher knew Niko was there and was looking at him as he waited for his meal to arrive.",
				" was a small rat. Niko took a step forward, only to be caught by a scaly paw, and felt his belly jolt. The rat snarled and bit into his shoulder, causing him to fall to the ground. Niko"
			],
			"0.8": [
				" he raised his tail and his eyes to the sky, listening for the sounds of any birds that might have been hanging out in a nearby tree. His eyes were keenly sensitive to the movements of the wind. He wasn't likely to be able to",
				" an elderly man had his hands on his hips and watched as Niko approached. Niko stared back defiantly.\n\n\"Ah…?\" the elderly man asked with an exaggerated frown.\n\nNiko shrugged and then tried to",
				" a man's black robe was parted and the gleam of gold and gems shone in his eyes. \"My lord,\" Niko said, bobbing his head at the newcomer. \"I'm looking for a young girl who might be here with you",
				" a tall man was casually swinging his arms in the air, shaking his head in what seemed to be a bewildered way. A smile tugged at Niko's mouth as the man looked over his shoulder at Niko. \"Ooh! You",
				" a pair of black shoes clicked against the cobblestones.\n\n\"I'm glad you are here, friend,\" the voice came from behind Niko. \"It's a bit late to be hanging out",
				" he raised his head and looked about. Niko waited until the butcher had returned to the main section of his stall and then let out a shrill whistle.\n\nNiko's voice filled the alley, his body swaying as he took a",
				" a small figure was staring back at him.\n\n\"I knew it was you!\" the woman cried, throwing her arms out to greet the kobold. \"It's been so long since I've",
				" Niko opened his mouth to take a bite, but instead the birds were snatched out of his mouth by a brown-furred hand, dragging him down into the street. A crunch of teeth echoed through the alley, but it was all he could",
				" a young man with long brown hair and a faint beard in a coarse cut was pulling the bird out of the blood-stained leather pouch at the end of his barbeque. The man stepped forward and placed the bird in Niko's",
				" he heard a muted crunch. Looking up, he noticed the loud crack of the window shattering, but it wasn't enough to scare him away. With a deep breath, he pulled the thin blanket he was wearing from around his body and ran.\n"
			],
			"0.85": [
				" Niko could see a dark shadow hovering in the shadows. Was that a kobold shadow or someone else? Niko's tail began to twitch anxiously. He knew he shouldn't be making any noise, but he was curious. \"O",
				" Niko noticed a large amount of blood spilling onto the ground. His curiosity turned to anger and he turned his head around, squinting in an attempt to find the source of the blood. To his surprise, Niko's eye met with a",
				" stood a man with a meaty hand that could barely conceal his hunger. Niko froze in terror as he knew the man would leap forward and drag him down with him, trapping him beneath his own weight. He held his tail up so that the",
				" his body now covered in blood, was a middle-aged man with graying hair and a thick neck and shoulders. Niko's eyes quickly darted back and forth between the man and his prey, hoping to find something he could use to try",
				" a row of furrows of frost were etched into the cobblestones. A groan sounded from within the shadows as the wind pushed aside the snow covering the stalls and lit the cold aisle in front of Niko. A quick glance at his companion",
				" stood a boy. Niko froze as the boy gazed up at him with curiosity.\n\n\"What are you doing here?\" the boy asked in a low, worried voice. \"I can't find any chickens.",
				" an enormous spider leaped from the cobblestone and disappeared into the shadows. The massive black insect dropped to the cobblestone, its slimy body spreading out before sliding back into its hiding place.\n\nNiko drew in a deep breath",
				" was a young man with curly black hair. A giggle of excitement escaped Niko's throat. \"Hello, sir. My name is Niko. And I am here to pick up a chicken. It is delicious, isn't it?\" Nik",
				" he dropped the chicken to the ground and then raced towards the sound. His tiny body strained for all it was worth as he ran along the alley. His ears twitched as he strained to hear any sounds that could possibly warn him that the meat had",
				" he made his way to the butcher's side and pointed to the birds. \"I have a wish,\" he said.\n\nThe butcher stopped cutting the chickens and turned to look at him. \"And what would that be?\" he asked, slightly"
			],
			"0.9": [
				" stood a man in a torn coat.\n\n\"Ah, my friend, I didn't expect to see you here!\" the man called out to Niko. \"So good to see you again,\" the",
				" a little girl of perhaps eight years of age turned around and smiled at Niko.\n\n\"You!\" Niko hissed in a low voice. \"You're getting yourself into trouble.\"\n\n�",
				" the tiny kobold was watching him with a beady eye.\n\n\"Excuse me,\" Niko said politely. \"I have a chicken for sale. I'd like to buy it, please.\"\n\n\"This bird is too",
				" a group of boys approached. It was the only other shop in the city that sold chickens, so the boys were practically a mob. Their leader, a gangly lad, had probably been a boy in his younger years, but now he was old",
				" was a small girl, hands linked with a gaily decorated cloak. She had a tall spear sticking up above her head. It was a red hauberk made of the same material as the cowl of the merman's coat. It was",
				" he was standing next to an older woman.\n\n\"He's been here for a while,\" said the older woman. \"He just likes to watch.\"\n\nNiko's dark eyes narrowed.\n\n\"Well, if you want him",
				" a young woman was glaring at him.\n\n\"Sorry, miss. I don't know who you are or why you're staring at me.\"\n\n\"I'm looking for a chicken. Can you tell me where to find it?\"\n",
				" was a large skeleton with a garishly painted skull.\n\n\"You can't fool me, fat guy. You're too busy trying to steal my food, I'm too busy standing up to stop you. But I can see you've got",
				" was a burly black-bearded man. The tall man had a weathered face that was filled with a smile that was full of promise and pride.\n\n\"You want the chicken, old man?\" the black-bearded man asked",
				" a short brown-haired man in a brown and grey-tinted coat with a white cowl sat on a stool next to a table laden with food.\n\n'Is that you, Nibedis?' Niko said. '"
			],
			"0.95": [
				" was the lazy-eyed, blue-eyed Kabam!\n\n\"Kabam!\" Niko shouted, flapping his ears and his small, black wings.\n\nKabam came bounding up to the side of the butcher.",
				" he watched the man holding the head up to the light. The head was covered in white, thin skin, and the neck was twisted and bruised. A young boy, barely taller than Niko himself, held the head and walked slowly toward the k",
				" a young man in a tattered coat was leaning on the wall, his eyes glued to the floor.\n\nThe butcher squatted down, peering around the corner of the stall to see if he was being observed. He rolled his eyes.",
				" was an old man dressed in a filthy, unkempt tunic and trousers. He was bending down to check out the chicken, the soiled knife making a rasping sound against the animal's thin skin. The man straightened up",
				" a pair of glowing eyes peered at him from the distance.\n\n\"Mm, mmm, mmm, mmm,\" the ancient voice sang, as the smile came back. \"Have you any lizards?\"\n\nNiko",
				" his eyes were glued to the new arrival.\n\n\"What are you doing here?\" he snarled at the woman behind the counter. \"You're lucky you got out of here alive!\"\n\n",
				" an old woman sat staring up at the stoop of the nearby building.\n\n\"Pity there isn't a nice enough wind to chill you all into a nice, cold drink,\" said the old woman, but she was smiling.\n\n",
				" he immediately dropped to all fours and began running away in a fast, ungainly manner.\n\n\"MOMMY, I'm not doing anything!\" he shouted, dropping to all fours and rapidly stalking towards the nearest open alleyway",
				" a large animal sat next to a smaller one, both looking up expectantly at the kobold. Niko decided that it would be prudent to move in before the creature who had sent him this message started a fight.\n\nHe loped",
				" Niko's head snapped around. \"What?\"\n\n\"The chickens are gone.\" The kobold spoke in an authoritative tone, his voice full of disapproval.\n\n\"Are they yours?\" Niko's eyes were wide.\n\n"
			],
			"1.0": [
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,",
				" a man was leaning against the wall, his back to Niko. The man's face was hidden by a hood, but Niko could see that he was a man of about his own age, with a long, thin nose and a long,"
			]
		},
		"rep_pen": {
			"1.0": [
				" was a large black crow. Its black feathers and ruffled red feathers were all that was visible through the hood of the crow.\n\nNiko stepped forward to greet the crow. The bird's loud voice echoed throughout the alley. The crow",
				" was the waif-like creature who had just spoken to him.\n\n\"Hey!\" Niko cried, before jumping down and running back to the kobold and his friend. \"Don't do it!\" he cried, pointing at the",
				" a squat figure stepped out of the shadows and onto the cobblestones. The man's face was a startling contrast to the kobold's black fur. In his hands was a large black wooden platter, with a tiny white egg attached to",
				" he drew his sword and leapt into the air, the chicken skittering in the snow in the process.\n\nThe kobold's attack was simply a demonstration of power, the first in a series of new power gestures that he would perform",
				" was a single fat customer. Niko gave a weak cough as he glanced around, and then looked down at the kobold's little body, wrapped in a cloak.\n\n\"Sorry,\" he said. \"",
				" was a man with short black hair and dark eyes.\n\n\"Hey, there's someone there!\" Niko cried, still keeping a cautious eye on the shadows in the alley. The man didn't seem to notice Niko, but Niko",
				" was a hulking figure clad in a thick woolen cloak. In his right hand, he held a long curved blade that was so long that it almost reached the end of his reach. His nose was sharp and his blue eyes had the shine",
				" his blue eyes gleaming, was a fellow hobgoblin.\n\n\"You must be the one,\" he said.\n\n\"I'm the one,\" Niko replied.\n\nThe two hobgoblins laughed and stepped closer, never",
				" the kobold was rubbing his tiny belly. The skin was already pink, the bird perfect, and it looked to be well-fed. The butcher had not left the stall after Niko entered, though, and the kobold'",
				" he caught sight of the small, dusty man grinning broadly at him.\n\nThe butcher, in the guise of an old man, had been a regular visitor to the men's room in the local pub. The last time he had passed through the"
			],
			"1.05": [
				" he watched in confusion as the butcher chopped his meat into smaller pieces before depositing the pieces into a large blue bowl of water. Satisfied with his next meal, Niko turned his attention to the man's stall. It was a large space with",
				" the wooden boards creaked slightly as someone quietly turned a corner. Niko followed the sound and crept quietly towards the sound.\n\nAn unassuming voice from the corner spoke quietly to him.\n\n\"You have chosen well, little boy.",
				" was a large black wolf.\n\nKobold were a lot like wolves in that they did not attack humans. Rather, they were peaceful animals who could be found everywhere, but mostly in cities. Most had started out as pack members, but",
				" an older woman was holding a large, white chicken and staring intently at Niko. Her blue eyes were wide with fear. Niko carefully approached the stall, approaching the woman only because it would be far too risky for him to attack her.",
				" the body of a tall man lay in the snow. With a look of dismay, Niko raised his gaze and saw that the man was, in fact, dead. With a sinking heart, Niko turned back to his dinner.\n\n\"",
				" stood a kobold.\n\nThe kobold was dressed in ragged clothing that was as dark as the inside of his cloak. His fur was as dark as his cloak and his eyes were as dark as the cloak. His nose was",
				" the giant-sized kobold looked at him. Niko opened his mouth, but nothing came out. Slowly, he lowered his head and sat back on his haunches, and his red tongue lolled out. Slowly, he resumed eating",
				" was a rather large dusky kobold. Niko didn't like the way this one looked at him, but he was going to have to risk it if he was going to get out of this alive. Niko froze. Could it be",
				" a massive winged creature had materialized and with an almighty screech of rage the big kobold swung his mighty wings and launched himself at the monster.\n\nThe kobold managed to avoid the flying butcher, but the impact",
				" a young woman stepped forward and smiled.\n\n\"I'm just visiting,\" Niko said. \"Would you be interested in a piece of chicken?\"\n\n\"I'm sorry,�"
			],
			"1.1": [
				" Niko suddenly discovered that there were only two people in the entire street. The first was a dirty old woman who had just been washing her hands in the small stream running from the city's fountain. The second was an old man who was sitting in",
				" his face turned toward the stall, was the figure of a man who looked about twenty years old. His coat was shabby and tattered, and his eyes were missing a few teeth. Niko shivered and crossed his arms, not daring to",
				" he saw a glint of metal. He'd been too caught up in his work to notice the dart that had been shot at him.\n\nNiko growled in anger, but a sly grin spread across his face. The dart was meant",
				" stood an enormous blacksmith, who immediately turned his attention to Niko.\n\n\"My kobold friend. How did you come to be here?\"\n\n\"A thief attacked me,\" Niko said proudly",
				" he noticed a figure slowly approaching.\n\nNiko stood, his fur dusted with snow, his heart beating loudly. The figure was walking toward him, its long red coat fluttering in the wind, a small black pouch dangling from its belt",
				" his eye drooped and Niko was a dead kobold if he didn't pay attention.\n\n\"Niko?\" asked one of the tourists.\n\n\"Yes?\"\n\n\"Could you please tell me how to get to the",
				" was a man in a smelly, tattered coat.\n\n\"Where's the chicken?\" Niko demanded as he looked down at the man.\n\n\"What?\" The man squinted up",
				" was a trio of cloaked figures. The hooded figure who was the kobold was a heavy-set giant with long blond hair that fell over his face and was tied in a thick, black bow that trailed down his back. In his other",
				" was a tall man. A man in a suit. Niko's curiosity overcame his caution. He ducked beneath the cloak and peered over the stall. The man with the suit approached the butcher, nodded at him and made a small motion with",
				" a man in a loose grey robe with a hood pulled down over his face was leaning against the wall, smoking a cigarette. Niko was afraid to move too quickly, fearing that his little prey would be caught in the sudden movement. However, when"
			],
			"1.15": [
				" he froze. His eyes narrowed in anticipation of the retribution awaiting him if he failed.\n\nBut the butcher didn't come out from his stall to see if Niko had fled. In fact, the butcher appeared to be in a much",
				" a large dark figure lumbered over and plucked the chicken from the carcass with an outstretched claw.\n\nThe butcher turned around to glare at his companion, then looked back at the chicken. He spoke in low tones, obviously annoyed that",
				" stood a young man.\n\n\"My name is Yusei,\" the young man said to Niko, who lowered his head to meet the boy's gaze.\n\n\"I'm Niko,\" the kobold said, proudly displaying",
				" was a cloaked figure, the dark cloak billowing about the kobold's shoulders. The kobold slowly approached the cloaked figure, turning to face him as he walked. Niko was an expert at stealth, as long as you didn't",
				" was another human, and it was clear that he was a bit more nervous than the butcher. The only reason for that was because he was an orphan who had been raised by an old man who had not spared him a single moment of life.\n",
				" was a young woman, dressed in a red cloak and carrying a long stick. It was so small that he could not see her face, but it was her scent that alerted Niko. She was looking in the direction of the kobold.",
				" his tiny body hidden by his dark cloak, was the big meat-eater who'd killed his meal.\n\n\"Told you I wouldn't let you live,\" said the man in a thick Southern accent. \"Didn't you hear",
				" was the kobold.\n\n\"Mm, mmm,\" said the kobold, as he raised his wings and stretched them out.\n\n\"Hey,\" said Niko, walking up to the kobold.\n\n",
				" was a short, thick, slender young man. Niko couldn't believe it! The man was standing there as if he was waiting for someone, not for a chicken.\n\n\"You are looking for the chicken,\" said the man in a",
				" he watched the poor man open his hand to reveal the dried chicken blood. With a sudden motion, Niko snatched the rooster's head from the butcher's fingers and dropped it on the ground. The chicken immediately flew across the street and hit the"
			],
			"1.2": [
				" an enormous male Krabby Cat crouched low, his dark eyes watching the stall-keeper intently.\n\n\"What do you want, mister?\"\n\nThe animal smiled, revealing rows of sharp, sharp teeth.\n\n\"You",
				" he glared at the man in an obvious way that should have alerted him that something was amiss.\n\n\"Shit, shit, shit,\" he hissed in an almost panicked voice.\n\nNiko felt his eyes burning into his skin",
				" was the younger brother of the man he was following.\n\n\"Yokai!\" the butcher called out, \"you can't be here!\"\n\nThe boy was taken aback. Niko'",
				" was the sharp, silver dagger that he had come to steal.\n\n\"Ah, you're back! Quick, move!\" yelled one of the other street boys who had witnessed the kobold stealing the chicken.\n\nThe other boys had",
				" an orange glow rose from the ground. The kobold's shadow was no longer hidden by a large pile of dirt. Niko was standing in front of the butcher's stall, his legs wide and his arms extended, the claws of his tal",
				" there was a large rat with three purple spots of fire underneath its dark fur.\n\n\"Whoa!\" Niko thought as the rat moved slowly forward. \"I hope this is some kind of joke!\"\n\nThe rat came to a halt",
				" was a man with a fearsome axe. The dull clang of metal echoing in the dim winter shop was enough to put a chill into Niko's bones. With a resounding bang the massive blade slammed into the flesh of the chicken and ripped it",
				" a young man was staring at him.\n\n\"Where did you come from?\" Niko asked.\n\nThe boy didn't reply, just kept staring. Niko realized that he had been hoping to get away with the secret he had overheard",
				" his eyes were locked on the meat in front of him. His tail lashed out, a soft squeak sounding behind him. There was a flash of blue light, a blur of motion, and then the large and deformed insect died. With a",
				" stood another little boy with his arm flung out, reaching toward the other side of the chicken.\n\n\"What's going on?\" Niko asked, his voice as clear as a bell.\n\nThe little boy was"
			],
			"1.25": [
				" there was a fat young man with a round, red-lipped face.\n\n\"What the heck?\" Niko said, stepping out from behind the stall. The butcher glanced at him, but Niko didn't care. \"The fuck",
				" Niko observed with interest the actions of the man that he knew was now taking his dinner. The man looked up from his work, his eyes scanning the street for someone that he knew to be in his way.\n\n\"What'",
				" he turned to look over his shoulder.\n\nNiko stopped abruptly, eyes widening.\n\n\"You! What are you doing?\" Niko yelled as the butcher called out in response.\n\n\"Looking for you,",
				" a tall man with a tall beard approached the door.\n\n\"I'll just be a moment, monsieur,\" Niko said calmly, his tone sweet and polite. \"I have an order to place.\"\n\n\"Ah,",
				" was a mohawked little boy who seemed to have escaped from some catastrophe. Niko grinned. It was best to play nice.\n\n' _Ai! Ai! Ai!_ '\n\nNiko turned around to see an",
				" was someone who had decided to follow his pouncing instincts and get a piece of chicken. Niko's ears perked up, his tail lifted to the side and he lunged toward the intruder, barely dodging the spiky tail of the lanky",
				" he surveyed the stall's display of bird bones. There were several small bones piled up, but he ignored them. If he was going to get caught and end up in jail, then he'd better be able to speak well. The knuckles on",
				" he quietly got to his feet and slowly made his way over to the door. The door swung open, and out stepped two burly men, who glared at Niko.\n\n\"No one wants to buy a chicken,\" said the first of",
				" the old man was licking his lips as he watched the beautiful bird fall to the ground.\n\nThe alley creaked as someone took a step forward, causing the cold wind to whip through the broken cobblestone. Without thinking, Niko quickly",
				" two small hooded creatures with human-like features watched him suspiciously. Niko paused for a moment before he began to stride toward the pair. He wasn't certain if he should make a run for it or stay put. He chose the latter"
			],
			"1.3": [
				" he looked up and caught sight of the boy who was now walking toward him.\n\n\"Uh… hello, boy. I'm hoping I can talk to you.\" The voice came from the small, thick stick that stood",
				" Niko saw the diminutive kobold's familiar claw clatter down the floor, narrowly missing the knife. Niko gave chase, and when the kobold turned and saw him, he promptly turned and ran away. His only response was",
				" stood his bony companion.\n\nNiko turned and ran through the snow in the direction of the giant cat's lair. The cold air that drifted through the streets was almost enough to make him shiver. On a whim, he decided to",
				" was another kobold, a smaller version of Niko. The smallest kobold had yet to be named, and his voice was unmistakable.\n\n\"You look pretty, little guy,\" the little kobold said, smiling as",
				" a man was quietly but forcefully pulling on his shirt.\n\nNiko frowned as he looked at the dirty cuffs of the man's jeans.\n\n\"How can you be so brave?\" asked the man, who turned out to be some",
				" was a man dressed in a leather vest and fur gloves. A far cry from his arrogant bearing, Niko's ears pricked up as he tried to figure out who this person might be. Was this another one of those street criminals who prey on",
				" was a tall figure dressed in dark clothing and carrying a whip.\n\nNiko had only seen him once before, in a mirror of some kind. He had been a kobold, just like all the other kobolds around the place",
				" a middle-aged man who looked to be in his fifties looked down at Niko. He stared at the kobold's impassive body for a moment before shaking his head and walking away. The butcher did not look up at",
				" was a stocky fellow in a ragged coat, with black hair tied back in a dirty bun. Niko hurried over to him, motioning for him to let him pass.\n\n\"How may I help you?\" the other said,",
				" was a man with an unusual black cap on his head. This was the most valuable thing that Niko had ever seen.\n\n\"Hello, Master,\" the cloaked kobold said, waving a claw-like hand towards the stranger. \""
			]
		}
	},
	"EleutherAI/gpt-neo-2.7B": {
		"temp": {
			"0.1": [
				" a large, muscular man was staring at him.\n\n\"Hey, you!\" the man called out. \"What are you doing here?\"\n\n\"I'm looking for a chicken,\" Niko replied.\n\n\"You're not supposed",
				" a large, shaggy dog was staring at him.\n\n\"What are you doing here?\" Niko asked, his voice low and menacing.\n\nThe dog growled and Niko knew he was in for a fight.\n\n",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a thick black mustache was staring at him.\n\n\"Hey, you!\" the man said, his voice booming out of the darkness. \"What are you doing here?\"\n\n\"I'm",
				" a large, muscular man with a thick beard and a long, pointed nose was staring at him.\n\n\"Hey, you!\" the man said, his voice booming through the alley. \"What are you doing here?\"\n\n\"I'm",
				" a large, muscular man with a thick beard and a thick black mustache was staring at him.\n\n\"What are you doing here?\" the man asked, his voice deep and rumbling.\n\n\"I'm looking for a chicken,\" Nik",
				" a large, muscular man with a thick beard and a long, pointed nose was staring at him.\n\n\"What are you doing here?\" the man demanded.\n\n\"I'm looking for a chicken,\" Niko replied.\n\n\"",
				" a small, dark-haired girl was staring at him.\n\n\"Hey, what are you doing here?\" she asked, her voice a little too loud for the quiet alley.\n\n\"I'm looking for a chicken,\" Niko replied",
				" a large, muscular man was staring at him.\n\n\"What are you doing here?\" the man asked, his voice booming through the alley.\n\n\"I'm looking for a chicken,\" Niko replied.\n\n\"You're not",
				" a large, muscular man with a thick beard and a thick black mustache stood with his back to Niko. He was holding a large knife in his hand, and he was staring at the butcher with a look of pure hatred. Niko had never"
			],
			"0.2": [
				" a large man with a long, bushy beard and a thick, black mustache stood glaring at him.\n\n\"What do you want?\" the man growled.\n\n\"I want to buy a chicken,\" Niko said, his voice",
				" a man was staring at him.\n\n\"Hey, you!\" the man called out. \"What are you doing here?\"\n\n\"I'm looking for a chicken,\" Niko replied.\n\n\"You're not supposed to be here",
				" a large black cat was staring at him.\n\n\"Hey, you!\" the cat called out. \"I'm hungry!\"\n\nNiko's ears perked up. He knew that voice.\n\n\"I'm hungry, too,\"",
				" a large black cat was staring at him.\n\n\"What are you doing here?\" the cat growled.\n\n\"I'm looking for a chicken,\" Niko replied.\n\n\"You're not supposed to be here. You're",
				" a large, muscular man with a long, thick beard and a long, thick scar on his face was staring at Niko.\n\n\"Hey, you!\" the man called out. \"What are you doing here?\"\n\nNiko jumped",
				" a large, black-bearded man with a long, pointed nose and a thick, bushy beard, was staring at him.\n\n\"What are you doing here?\" the man asked, his voice deep and gravelly.\n\n\"",
				" a small, dark-haired woman was staring at him.\n\n\"I'm sorry,\" she said, her voice muffled by the scarf she was wearing. \"I didn't mean to startle you.\"\n\n\"It's all right",
				" was a large, muscular man with a thick beard and a short, thick moustache. The man was dressed in a long black coat and a black hat with a large brim. He was holding a large butcher's knife in his right hand and",
				" a large, muscular man with a thick beard and a red-and-white-striped shirt was staring at him.\n\n\"Hey, you,\" the man said, his voice booming out of the darkness. \"What are you doing here",
				" a man with a long, black beard and a long, black cape stood watching Niko with a look of utter contempt on his face.\n\n\"What do you want?\" the man asked, his voice a deep, raspy growl"
			],
			"0.3": [
				" a man was staring at him.\n\n\"What are you doing?\" the man asked.\n\n\"I'm looking for my chicken,\" Niko replied.\n\n\"I don't have any chicken,\" the man said.\n\n\"",
				" a man was staring at him. Niko's heart skipped a beat as he recognized the man. It was the man who had been following him all day. Niko's eyes widened. He was sure he had seen him somewhere before, but where",
				" a small, round woman with a bright smile on her face was staring at the kobold.\n\n\"Hey, you! Come here!\" she called out.\n\nNiko paused, but only for a moment. He was not going",
				" he saw a large rat scurry away.\n\n\"Well, well, well, what do we have here?\" The butcher was a large man with a long, bushy beard and a thick mustache. He had a large belly and a large",
				" a small, wiry man with a long, pointed nose and a long, pointed beard was staring at him.\n\n\"You're a kobold, aren't you?\" the man said. \"I've heard of you. You're",
				" a tall, thin man was staring at him.\n\n\"I'm looking for the chicken,\" Niko said, his voice quiet and calm. \"I need to get it.\"\n\nThe man's eyes narrowed. \"You're a k",
				" a large, muscular man was staring at him.\n\n\"What are you doing here?\" he asked, his voice carrying a hint of anger.\n\n\"I'm looking for a chicken,\" Niko replied, his tail flicking nervously.",
				" a large black cat was staring at him.\n\n\"What do you want?\" the butcher asked, his voice a low growl.\n\nThe cat growled back, \"I want to eat your chicken.\"\n\nThe butcher looked at",
				" a large black cat with a white belly and a single black eye was staring at him.\n\n\"That's a good one, Niko,\" said the cat. \"You're a good kobold. You're a good kobold",
				" a man was staring at him.\n\n\"Hey, you!\" the man called out. \"What are you doing here?\"\n\n\"I'm looking for a chicken,\" Niko replied. \"I'm hungry and I need to eat.\""
			],
			"0.4": [
				" a large man with a thick neck and a beard to match stood glaring at the kobold.\n\n\"You!\" he growled, his voice deep and menacing. \"You're the one who stole my chicken!\"\n\n\"I am",
				" a young woman was holding a very large knife in her hand.\n\n\"Hey!\" Niko hissed, his voice carrying easily over the sound of the butcher's knife as he stood up and took a step forward. \"What are you doing",
				" a small, bright red-haired girl stood, holding a small, bright red-haired boy by the hand.\n\n\"Hey!\" Niko called out to the girl. \"I'm looking for the chicken.\"\n\nThe girl looked up",
				" a man was trying to shove a large wooden box into the back of the stall.\n\n\"Hey, you!\" the man shouted. \"Get out of here! I'm trying to get in here! Get out!\"\n\n\"I'm",
				" a large, shaggy dog stood, his head low, eyes darting nervously from side to side.\n\n\"What is it?\" Niko asked, his voice quiet and calm.\n\n\"I'm looking for a chicken,\" the",
				" a large man filled the doorway. Niko's eyes widened as he saw the man's broad shoulders, his thick neck, and his massive hands. The man was wearing a long leather coat with a hood that was pulled up over his head. His",
				" a tall, thin woman with long brown hair and a dark, tanned face was staring at him.\n\n\"You're the kobold I saw earlier,\" she said, her voice a soft, melodic melody that was strangely familiar.",
				" Niko saw a large, ugly, and very angry looking man with a long beard.\n\n\"You!\" the man snarled. \"You! You!\"\n\nNiko looked up. The man was holding a heavy, curved blade",
				" was a man who had been watching him. The man was tall with a long, lean face and a bald head. He was dressed in a fine leather coat and wore a black hat that was pulled down low over his eyes. He was smoking a",
				" a young man was staring at him.\n\n\"What do you want?\" Niko hissed, his voice low and menacing.\n\n\"I want to buy a chicken,\" the man said.\n\n\"I don't have any money"
			],
			"0.5": [
				" a massive, black-bearded man with a long, pointed nose and a gleaming white beard, was a very angry looking woman.\n\n\"And who are you?\" she demanded, her voice rising to a sharp, angry pitch.\n",
				" a man in a black cloak with a hood pulled tight over his head looked on.\n\n\"You've got a good eye,\" the man said, his voice muffled by the hood. \"I'm the Black Cloak. I've been watching",
				" he saw the butcher himself staring at him.\n\n\"You're not going to steal my chicken, are you?\" the butcher asked, his voice filled with suspicion.\n\n\"Of course not,\" Niko replied, his voice as unthreatening",
				" was a small, brown haired girl.\n\n\"Hey, what are you doing here?\" The girl said, her voice muffled against the snow.\n\n\"I've got a chicken to steal,\" Niko said.\n\n\"",
				" a man was looking at him. He was tall and thin with long blond hair, and he wore a long dark cloak that fell to his knees. Niko smiled and waved. The man raised his hand in greeting, and Niko waved back.",
				" a very large and very angry-looking man was glaring at Niko.\n\n\"What do you think you're doing?\" The man's voice was deep and rumbling, causing Niko to jump back. \"You're stealing from the butcher",
				" a large, muscular man wearing a black leather jacket and tall, black boots was staring at him. Niko's heart sank. The man was staring at him with an intense, almost maniacal expression on his face. Niko had never seen him",
				" was a man.\n\n\"Hey, you!\" the butcher called out to the man. \"You got any more chickens?\"\n\n\"Yes, I do,\" the man said, stepping out from behind the butcher's stall. \"I have",
				" a man was staring at him with a strange, blank expression on his face.\n\n\"You're a kobold, aren't you?\" the man asked.\n\nNiko was startled. The man was dressed in a black leather coat",
				" a large man in a black cloak and fur-lined hat stared at him with a sneer on his face.\n\n\"What do you want?\" The man sneered, his voice echoing in the alley.\n\n\"I want to buy"
			],
			"0.6": [
				" a small, sad-eyed woman with long, matted hair and a face like a skull sat on the ground. She had been crying, and there was no doubt in Niko's mind that she was the cause of the woman's sorrow.",
				" a large dog was staring at him.\n\n\"You know, I don't think you're supposed to be doing that.\" Niko looked up at the dog, and it growled menacingly. The butcher turned around and saw Niko and",
				" three men were gathered, looking right at Niko. The butcher turned his attention back to his work, and Niko slipped into the shadows, hiding in the shadows and waiting patiently until the butcher finished up and left the stall to feed his chicken.",
				" a young woman was staring directly at him, her large eyes wide with shock.\n\nNiko's eyes widened with horror. He slammed his tail down on the ground and leapt to his feet. He ran into the alley and up the stairs to",
				" a large Roknari man was attempting to lever open the stall's door.\n\n\"No, you don't!\" Niko growled softly, his voice barely audible over the sound of the wind picking up. The butcher was too busy",
				" a large, three-legged spider was squirming in the snow. Niko watched it for a moment, wondering what it was doing there, then he turned and crept back down the alley.\n\nOnce he had returned to the butcher's stall",
				" a young woman stood, looking around, her face flushed with excitement.\n\n\"What?\" Niko whispered, moving to his right in case the butcher was listening. The butcher was busy cutting up the chicken, so he had to wait. He",
				" a dark-haired man was holding a knife to his throat. The man's eyes were wide with fear and he was staring at the butcher with a look of utter terror on his face. Niko slowly circled around behind the stall, but the man",
				" he saw the butcher's assistant step forward.\n\n\"Excuse me, sir. I'm afraid I have to inform you that all the chickens in the butcher shop have been stolen.\"\n\nNiko stood up straight and glared down at the",
				" an enormous black cat was staring at him with a strange, wide-eyed expression. The cat, easily the size of a large dog, raised its head and looked down at Niko with an expression of pure horror on its face. When Niko"
			],
			"0.7": [
				" a young woman in a blue cloak stood frozen, her hands clutching a handful of vegetables. The woman's fur-lined cloak was open to reveal a small white silk throat scarf, with a single gold pin, which Niko guessed to be a family",
				" was a man in a long brown coat.\n\n\"Excuse me, would you like to buy a chicken?\" the man asked, his voice deep and rich with a slight southern accent. Niko stiffened, knowing that this was the butcher",
				" a small man in a dark green cloak and a brown hat with a green feather on it was robbing the butcher's stall.\n\nThe man made an effort to be inconspicuous and kept his steps slow and quiet. Niko crept closer,",
				" was a man with a sword in his hand. He was looking right at Niko, and Niko knew he was about to draw his blade and attack him.\n\nNiko leapt toward the man, and in his haste he forgot to keep",
				" was a large dog barking furiously. The meaty, red tongue lolling from his mouth, the large, unkempt black-and-white dog was the size of a large mastiff. Niko had never seen a dog this",
				" a young woman stood holding a large wooden pail of water.\n\n\"What can I get you?\" she asked, her voice as soft as a whispering breeze.\n\n\"Chicken,\" he said with a friendly smile.\n\n\"I",
				" a man was looking at him. He was wearing an unusual outfit: a black cloak, and a small black cap on his head. His features were hidden by his black hood, but Niko recognized him. A figure who was a walking advertisement for",
				" a large dog had suddenly appeared. The kobold strolled over to the dog and greeted it with a friendly sniff. The dog sniffed back, growling softly.\n\n\"Hello, Niko.\"\n\n\"Hi.\"\n\n",
				" Niko saw a small boy no more than twelve years of age holding a chicken between his two hands. He was holding it by the neck and with his other hand was scraping away at the feathers to loosen them from the body. Niko had never",
				" a large dog was growling and snapping at the butcher's back. The butcher turned slowly around and stared at the dog, then back at the butcher. After a moment, he continued to cut his chicken.\n\nNoticing the dog, Nik"
			],
			"0.8": [
				" a fat man with a large belly and a heart of stone looked down at him.\n\n\"Excuse me?\" asked the man. \"What you looking at?\" The butcher rushed over to defend himself.\n\n",
				" a large black rat was trying to nibble on the tender flesh. Niko froze in the alley, his jaw dropping to one side.\n\n\"What is it with you, Niko?\" The voice was a deep male voice",
				" a huge wolf, all dressed in black except for the white blaze that ran down his spine, had his huge paws on the butcher's chest.\n\n\"Hey there, little kobold, what are you doing stealing my chicken?\" he grow",
				" he heard a familiar voice.\n\n\"Well, well, a big kobold with no tail.\"\n\nNiko straightened his back and turned slowly, his eyes going wide with fear as he gazed upon a smirking human stranger that",
				" Niko could see a familiar figure: the two-headed pig farmer. As the butcher was busy arguing with the pig farmer, Niko was able to slip away without anyone noticing him.\n\nBreath freezing in his lungs, Niko walked",
				" was a man with a single fish hook in his hand. It was an ornate steel hook with a pearl-like head, made to fit over the corner of a man's eye. Niko had seen this hook used on more than one occasion",
				" a fierce looking man with black hair and a gash of red across his forehead stood motionless. Niko tried to step around him, but a strong hand grasped his collar and held him still.\n\n\"I said he would not run,",
				" was an enormous cat. The feline was as tall as an ogre, its body covered in rotted, matted fur and its scaly skin was as white as snow. A face as wide as that of a puma stared up at Nik",
				" a man was hanging on to the chicken by its feet. Niko smiled to himself as he cut down the man with the sharp knife, leaving his victim hanging by his feet. His grin widened as he pulled the man off the dead chicken. Nik",
				" a tall, muscular man in dark clothes and with a stout jawline glared at him. He was tall and muscular, with short dark hair and dark eyes, and he wore only a thin red cape, with just a glimpse of a silk undershirt"
			],
			"0.9": [
				" he saw the thin man step out from behind the butcher's stall. He approached the counter, his eyes searching for the man with the wares. When he saw the kobold, he squinted his eyes and hissed, \"N",
				" he saw the almost invisible form of a lone blonde woman, holding a knife high, walking towards him. He flicked his tail several times to emphasize his terror and walk with purposeful agility as he made his way towards the woman. The woman began",
				" a dark cloaked figure moved stealthily from shadow to shadow across the alley. Though he was no master, the kobold couldn't fail to recognize the man.\n\n\"Hello, kobold friend. We haven't had much time to",
				" a towering figure had appeared. The large green 'Skurken' goblin was blocking Niko's exit from the alley. Niko was trapped.\n\n\"A moment, perhaps?\" Niko's eyes narrowed in anticipation of what he expected would",
				" he saw a small gray dog bounding toward him. Unlike most domestic dogs, this one was not so friendly. It grewl menacingly at Niko, and he knew he was in trouble. Just then the butcher returned, his gaze falling on",
				" a huge spotted piglet stumbled into view. It was barely half the size of a normal piglet. It bawled and struggled feebly to stand on shaky legs. \"Stupid little thing,\" he muttered to himself. He would just",
				" a young boy of eleven or twelve stood huffing and puffing. The boy's small knobby knees seemed to sway back and forth as he struggled to keep up with the growing crowd of people standing around the butcher's stall.\n\nN",
				" a big thief was dusting himself off. He was almost as big as a house cat but the fur ruff and small ears hid his small brains.\n\nThe thief chuckled softly to himself as he admired the rear of the butcher's shop.",
				" an iron fist caught Niko on the side of the head. Niko fell heavily to the ground, clutching his head.\n\nDazed, the butcher slipped away in a blur of motion. Immediately after taking off, Niko rose to his",
				" a quick flash of light pierced his dusky cloak and rippled toward the meat that was still hanging on the butcher's line. Niko twitched with surprise. He wasn't the brightest animal on the planet. He had a tendency to jump"
			],
			"1.0": [
				" he spotted something dark and... animate. He gasped as he realized it was indeed a girl. She was in distress, desperately clutching her left hand which was clenched tightly around a knife. Her eyes were empty, as if she'd been struck dumb with",
				" a short, wiry man, with a black patch over one eye, was staring in his direction. The butcher turned slowly to see who had disturbed his already crowded stall. Niko crept into the shadows, unsure of what would happen once the butcher",
				" a boy dressed in ragged, threadbare clothing was staring into the large butcher's eyes, his face a pale, puffy white, the skin stretched tightly over the bone.\n\n\"What you got there, kid?\" the butcher inquired,",
				" tall claws dropped slowly down from the butcher's feet, revealing a pile of fresh grain he'd only just grabbed out of his stall. Where the hell had he gone? In an angry snarl, Niko hurled himself at the chicken, ripping out",
				" one of the shop's owner's companions leaned on his shovel, giving him the once over as he surveyed the carnage. The kobold scurried across the street to the doorway and then threw his cloak around his body, keeping the chill wind",
				" two tough eyes gleamed back at him. Once again, Niko was gratified to see that the wooden walking frame had been repaired without the need of assistance.\n\nAs Niko glanced about, he saw that the drab, white buildings",
				" a tall man in leather armour leaned in close to make sure that the fowl he was selling was indeed his. The man noticed the odd-looking young kobold hovering over his body.\n\n\"What are you?\"\n\nNiko",
				" a large orange beast seemed to sense something was up, and he cautiously eyed the kobold. The cat stretched his neck forward, completely ready for a snack, before moving toward the interloper. If he wanted to eat the kobold",
				" he saw a large cat emerge from the alley. Only when she saw Niko did she look behind her for the thief, and when she realized that he was waiting for her, she hurriedly turned her back to look through the window.\n\n",
				" Alrick lay unconscious on the ground. Niko hissed through his fangs as he hastened over to investigate.\n\n\"Alrick!\" he called out. \"Alrick!\" He sounded so desperate that Alrick felt as if he'd"
			],
			"1.1": [
				" he had an eye-full of gleaming silver—a sharp sickle and ax! Of course.\n\nNiko bounded from the shadows, tripping on the sticky, wet fur of an errant carrot he had just picked up from the",
				" he caught sight of an expectant audience. Niko bolted for cover before the crowd realized that he was running away.\n\nThe thought of surviving with an armful of food made him nauseous. Instead, he sprinted through the dark streets",
				" he recognized movement. Judging by the obvious reaction of the five beefy, bare-chested men who now stood near the butcher's stall, Niko wasn't the only one who had entered the shop. Taking a second to admire his handi",
				" a wide pair of feet approached. It wasn't the butcher but ‘Evilman' who climbed over the stall top and grabbed Niko by the neck. Quickly severing his head from his body, he pulled his body back",
				" a dwarf known to be heavy of foot, it was no surprise that he'd be hard at work right now. Narrowing his eyes at the cowering, wriggling person, he spoke coldly and with a smile on",
				" he saw a small figure appear, holding the long handled bone knife awkwardly, and collapse onto the ground. The crook of the person's elbow protruded from the sleeve of the threadbare red cloak as they rested against the stone pavement. Niko",
				" staring at him intently, was Rob Barreleau. \"Over here, smart one.\"\n\n\"I need the knife.\" Niko waved a hand at his wrist as if he held a guava or other precious plant. \"And",
				" a girl was staring hard at the stall door. Without thinking Niko leaped up to catch the opening of the door. \"Aww!\" he chirped happily, \"You found a chicken. Take it inside and eat",
				" he had managed to slip his food through the fingers of an uninterested butler. The paltry theft was somewhat of a relief.\n\nNiko would have to hustle if he wanted to get away from this dark alley without drawing any",
				" were the two men that he expected to find himself waiting when he approached.\n\n'Hey meat check, babe!' said Rajiv, 'Come join us. I'm home! What are you looking for?'\n\nHe answered Rajiv's"
			],
			"1.2": [
				" two tiny noses could be seen peeking through the loose hood of his soot-covered hoodie. Frowning, Niko crouched lower until he heard the snickering of two tiny tongues darting out of his hoodie as he",
				" a squat dark figure walked slowly into view. It was identical to every other tiny face in the shadows of this tiny world, which made it very likely that they were sent here to bring him back home. In all honesty, he'd rather it had",
				" was a woman. Niko began to turn around as he imagined he was face to face with some horrid queen, and she'd scornfully toss him into a barrel of torture and rope. Unfortunately, that wasn't the case",
				" looking furtively through the opening between two narrow slats, Niko saw a brown stain on the snow in front of his friend. Quickly he plucked the rotten piece of meat from his cloak, leaped on the butcher's stall,",
				" were three meatballers wearing ordinary trousers and topcoats, but they had on disguise kits and veils that gave them away.\n\n\"They know where the chickens are, I assume,\" sneered Niko, his words",
				" a woman in the tightest of fitting clothes, similar to a bathing suit, stepped out into the cold blustery breeze, directly in front of him.\n\nNiko tensed at the sudden appearance of the woman, her icy blue eyes",
				" just as the town's four city watchmen were about to drag their meat cleaver into the soft spot beneath the pig's throat, was none other than Obidium the grey kobold, swathed in thick fur. In a matter of moments",
				" he saw three filthy adventurers fighting over the body of one scrawny lummox. Unbelievable! The butcher caught the eye of a woman approaching from the opposite direction, a wizened old hag who was completely naked save for",
				" Niko heard what could only be the clattering of rat bones. Was someone coming back? He thought so. The rat's call almost sounded like a quiver of excitement, almost like a little kitten testing the territory, making its mind",
				" was a young man of Niko's size and appearance. After surveying the vicinity, he ducked down and picked up his meal: his prize: a fully-grown chicken. Now at last able to kill a grown chicken without someone noticing,"
			],
			"1.3": [
				" Drell wandered forward and smiled down at Niko. Drell's mismatched orange eyes were shaded by dark brown eyebrows that ran over them like ribbons down his snout. His mud-streaked hands fiddled nervously with the brass-",
				" he found Niko's breath stuck to his back as he surveyed his domain.\n\nAt the far end of the alley stood a fat, fat fat griffin. Smirking, he looked down at the kobold, his elongated",
				" an awning flopped slowly open and he couldn't miss what lay outside.\n\nWith a swift kick, the little kobold vaulted over the side of the stall and scaled the top of the awning, landing",
				" the butcher was now lying there, snoring lightly as though he hadn't the strength to breathe. Whoosh! A thought instantly flashed through Niko's mind: a sodden cardboard box stitched with strong leather straps. The chicken had disappeared",
				" the whole hog turd, Leireggbe, was grinding her legs into a bird that was running at her. She rolled to her feet with a quack and started screaming. In her other hand, a heavy lump of black coal clanked",
				" she tried to bring his attention back to his enterprise. Not easy since her head was only a fraction of the size of his. The full moon had moved slowly across the sky as she struggled to drag his attention to the point where she wished he would",
				" a lovely brunette, bleached blond hair waving about her shoulders and a smirk upon her pretty face told Niko all that he needed to know.\n\n'Why, he's been snacking again!' The blonde cackled in g",
				" a brutish man of Middle Eastern descent took the birds from the bag and raised his hand to show him where he wanted them. Niko stood perfectly still as he picked up the knife from the man's hand and spun around, pointing his",
				" Niko heard a dull crack, then he saw a blemish form on the butcher's white bread. One wing was starting to fray. Taking care not to breathe on it, Niko picked up a meat cleaver from the butcher",
				" stood a completely ordinary-looking young woman holding a hook attached to a slender rod that was apparently used for picking up pennies. As a pimply-faced young human, the kind with no personality and the one who was being mistaken for a p"
			],
			"1.4": [
				" half-starved dog and doll went about their routine. Dog growled. Doll scrunched up in the fetal position. It was a nonstop cycle of both attacking the doll and waiting for it to tell him where it was kept. Then",
				" his ugly, six-armed friend gawked at him with drunken eyes. The black tom didn't like his new opponent, and kept his eyes locked onto Niko while muttering something to himself, which Niko did not bother to understand.",
				" two women were staring at him in consternation. A bizarre mixture of emotions were splashed across the faces of the two elderly women: pride, wonder, shame. Before either woman had a chance to order him away, Niko took off down",
				" the diner saw the dog and growled in recognition, and realized that the cat had just stolen his meal!\n\nIn an effort to defend himself, Niko tore off his clothes, tossed them to the floor and tried to scale the picket",
				" only the red of the skin, through the neatly cut scallop down to the grey feather show made a blurry red on the blackened gray wood of the stall's cracked walls. Sheeplin stumbled and teetered to a halt just behind",
				" his stomach feeling surprisingly warm for the cold, was a green humanoid creature with pointy teeth. He stood on a thick clump of snouts the length of a human's arm and judging by the distinctive cast of his eyes, it was the little",
				" waiting to buy him some on the spot, was an old, old man. Staring hard at the stout skeleton of a knight before him, Niko sneered. But the hag stared at him with a particularly cold, piercing gaze and told",
				" was Fermium Fireworker Nitongrel. Niko hid in the shadows of the stall and took hold of Nitongrel's tail as Fermium snagged the bird with a violent tearing. An outraged crow began calling and the spectators began",
				" and behind him, on the other side of the stall, was Stagnation - Vents Snowflake! The female zoinkat was rather less than impressed by Niko's presence. That is, when Niko wasn't standing and scratching himself",
				" two rough looking bullies poked their heads through the heavily tinted door. Both were obviously out of shape and hadn't exercised for days. Wiping the glistening drool off his sharp pink tongue, Niko figured that if he walked over to"
			],
			"1.5": [
				" he wondered if that sneaky smith might be even skinnier and dirtier than he was. His whole family's food that was food, but some meat went better with gruel than others. He hated how sickly the meat at",
				" what seemed like half of his head looked at Niko with empty eyes and another big one protruded forward. Another thud and a shriek accompanied by bloody nappy wipes of hell splattered over the cobblestone and dirt was followed by a",
				" four huge stallions huddled at their ease. Niko pushed aside his two startled companions and pulled his small jonchal from the other end of his tail. That being said, if someone is an illusion then even kobolds, including Nik",
				" he peeked in the man's direction. Hunching low on his haunches, Niko let out an amazed shriek and wheeled his body to bolt in another direction. Stopping only a hairbreadth before going completely wrong, Nik",
				" a sudden, pale mouse stood as high as a dwarf could on all fours, white tail fanned behind it as it turned to survey the alley from behind a bunch of spiky trees. Tucking its tiny pink nose underneath one eye, the",
				" was an unattended well-fed half-goat who held a pot of blue cheese around her slim leg. With this pot of cheese and a blanket, she appeared to be sitting comfortably in the afternoon sunshine. \"Good day to you,\" the",
				" some kind of hunched figure wrapped in deep purple robes. On his small, bumpy little chin,Niko traced the faded, faded word Animaque Duchies of Oniloin in elaborate red letters. Oh shit. My devil isn",
				" someone had run into him! Was this a simple quarrel between two merchants that escalated into a drunken brawl? No, there was too much blood dripping off the halfling in a matardco sodden shirt. But when Niko found a victim",
				" two beautiful females floated just inches away. \"Excuse me, friend,\" the bovine announced politely. \"I don't mean to be rude, but how are you today?\" One blue feather hung down from the red horse-haired lady's",
				" an unassuming and relatively short woman stood completely motionless, eyes fixed on the ground. The light footsteps of the girl in her white jacket hurried closer until she was standing within spitting distance of Niko. This was Chona – Lady Susanna�"
			],
			"1.6": [
				" ready for quick exit, was none other than Mortus with most of his tiny axe hidden in his huge thumb. I knew I should have thrown my little egg closer to the butcher's pig's trotter. It's a little surprise and meat",
				" two gossips, smiling at him slyly, caught his eye. A mysterious dream? He didn't have time to dwell on the idiocy of the dream before the distraction caused him to lose focus on the busy street, tripping and falling",
				" two monks had stepped out into the cold and broken night. Niko immediately froze and for several moments appeared paralyzed as the butcher saw what the figures were and both stared back into the shop. The Butcher raced around the side of the shop and ran out",
				" holding a five-inch ceramic blade pointed down, were several strange-looking lumps of clay. Glancing nervously back at his supplier, who grinned cheerfully from the cashbox he was only pretending to dig through, Niko backed away and swiftly",
				" Niko started to murmur under his breath: \"Silence!\" Silently he moved into position behind the stall, silently he watched to ensure that no one glanced at the small winged insect as he took what little remained of his dinner. His",
				" was a pudgy piggy face topped by red bristles of straw. Yawning at his unpleasant task, the jowl-chinned man dropped the animal and left to run a thick red stew down the alley.\n\nHis next",
				" Mikcave had swung the meat trade grenade.\n\nThe massive pit round Murtaja was used to like clay shots by thousands of ancestors tended it from the beginnings of the town. Their solid wooden body has rattle designed to pierce the",
				" three low, dark magicians had suddenly materialized. One began packing his purchases into his bag, the next man wiped the neck of his knife on the end of his sausage and snatched a pair of cheesecloth wrapping rolls off a hooks on the side",
				" the gleaming drover and father of seven crossed his arms to stop anyone from interrupting his dinner with one last annoyance. He wasn't like Niko or Kaspar either. He probably never left the vault, kept a bottle of beer",
				" another large, middle-aged kobold was investigating a bowl. He suddenly jumped and growled and then slapped the small table.\n\n\"Breakfast or lunch?\" asked the other kobold as he continued to study the bowl, his"
			],
			"1.7": [
				" something heavy and rectangular hit the dirty snow-covered ground and Niko instinctively readied himself to lunge at it. Peeking under the baroque mask, he could barely make out what the unfamiliar form actually was; it was a dull gray",
				" just inside the little nook in the side of the large tan wall, was Nico, the royal buttaku. Nico was rocking gently back and forth, ruffling the matted black fur on the back of Niko's neck, laughing gle",
				" not four feet away from Niko, was Kalotys. The wormy little ruffian dropped a chicken bone directly on to Niko's shivering cheek, next to his left ear. Picking it up he eyed him at arm's",
				" three canine-sized giants guarded the wooden boards surrounding his treasure. Despite having been discarded like any last resort by the crude immigrants who now owned the store, the boards were still recognizable by the nicks and scratches caused by the thousands of claw marks they",
				" was a girl of about seventeen years. Of no consequence. Small, pretty, short black hair. Good body. She wore red knee-high boots and looked casually out of place. Shrewd eyes. Much older than the Butcher of Oapt",
				" Lokesh the Sacred Bearer coughed just once. Immediately Lokesh reached up with his magical touch, transformed himself into a heaf of wheat. He extended the power into the magical handle that clutched a few hairs from a pork",
				" an immaculately-dressed alchemist slouched with the brief grace of many girdles behind the square pole they all stood behind.\n\nWithout being summoned to the execution he nodded quietly in satisfaction at his alchemist assistant'",
				" Koba gave him an almost enthusiastic thumbs-up sign. All it needed was a piece of chalk to make the words come out properly and a sentence explaining to all that he should never ask an animal to dance before haggling over the price,",
				" was Beele. There was something of the witch about the silvered green silk sack of blood that now draped over her rounded hips. That concerned Niko because she might as well have tossed herself onto the back of his head, something Beele never",
				" dressed only in an old skirt that was beginning to cling in damp winter's clothing was Eliott Butler. The executioner's pale skin radiated misery and oppression as he reached for a steaming plate from the overflowing wooden chopping block. In"
			],
			"1.8": [
				" standing a scant few inches taller than him and dressed in fine armour complete with glaives and spiked rings adorning every finger and toe, stood N Execute – commonly referred to by their better-educated named foreigners as 'Boring Flesh,'",
				" two kobolds were offering themselves to the seller. Their yellow faces, polished leather skin and torn knitted tunics formed a silhouette that seemed otherworldly. Niko hesitated only for a moment before sliding his feline coils under the cloaked rival to",
				" Niko squinted through the blinding snow. Glancing down the street and down to the crossroad by which they had left the butcher shop, he located the co-ordinates on a small blue stone mounted on a cinder-block,",
				" almost two feet away, stood another pale-green animated siren who also smiled a little sadly. \"It's about time you showed up,\" she sighed as she leaned back and slumped with exhaustion. Niko watched closely as she became annoyed at the",
				" Rotos spent his time manipulating small branches that clung to the hedge to pin himself down so he could scoop the game onto the rim of his nose. Rotos quietly handed him the cutted wing and nudged the kobold forward until the",
				" about to let go with a hammer in his hand, stood Doctor VladSlasherZeven. The knotted fist was full of flour, not against him but against the window of his nearby laboratory. Every sword he knew at this point was full of",
				" a youngling snagged the short feathers and left a perfect snowflake where her arm touched his side. And who was the fortunate stallholder to catch the warm greeting? If anyone were smart, they'd recognize this act of pure cruelty, Niko",
				" he discovered several humans glaring malevolently at him. Then he heard their commander's command over the echo of steel on steel; Niko backed up, eyes twinkling as he stole through the alley in time to miss being crushed by a human",
				" Fisk, Kris & Hattie's unkempt four-legged host answered his call. What is it?\"Fisk is still working on a project. If he doesn't want you in here, let me",
				" on a few heavy wooden stands lined with salt and pepper, were several Chinese cockerels and mongrels. Fierce as cats. Niko turned on his heels and surveyed the shop, making sure his back was still against the brick"
			],
			"1.9": [
				" Niko recognized Janette who'd become fixated on his stolen poultry. Janette didn't know what was going on either; she stood there with two poachers wearing nothing but expensive designer stilettos, beer bottles held tightly under their ar",
				" he noted a hole dug at least ten centimeters in from the base of the man's shop. Not the traditional brown_look_hole_with_almond_ornament_. Maybe he meant an _ostrichel?_ Worthy; a",
				" he held a lantern, examining it as he passed, just for extra protection. After he collected the meat and fresh poultry for the morning, he began to follow an invisible line of orange-tinted clay, pulling up the shirts of those too",
				" was another three-footed attacker, while both of their friends watched curiously, noting the crouched posturing of Niko's noble descent before resuming their meat-gobbling quest. For once, a minor bummer really hurt – little",
				" there stood Saint Vulpai with a muscled shoulder pad balanced on his head, the sap bleeding steadily into the soot and frost of the storefront. His mocking face with the right nostril drawn upward over his long boney jaw filled Niko with",
				" where one might normally find fresh sausage for a roast, Niko witnessed another kobold who had similarly seen better days. Unlike him, the ill kobold carried a ghastly lean set to his pale skin, bags under his eyes and",
				" was someone tall. Without slowing down at all, Niko scurried off towards a less obvious path, a bright pink shoeprint firmly imprinted in the snow where his frantic sprint had taken him. What would its owner say if they confronted",
				" a broad smile formed on his scaly lips. Walking cautiously out of the darkness that surrounded the narrow alley, Niko swallowed deeply and took a deep breath in an effort to remain quiet as he approached the white abomination that could easily equal the madness",
				" however, he froze in alarm at the sudden weight crushing into his body. Without daring to breathe, he remained motionless.\n\n\n\nSpitting on the ground, he spit again in what looked like fury. Once again he clenched his fist and",
				" the baron grabbed Niko's hind leg and twisted it against Niko's pastern, hard enough that a yelp of pain almost forced Niko to drop the bird.\n\n'Next,' the butcher ordered, nodding at Niko"
			],
			"2.0": [
				" Pflaggwald Cimoni, with great size and pride in her many honours, strode forth like the heel of the shining city that it was, as she offered to cure all his ailments. 'May the alchemists of Arc",
				" a large and ugly wolf—a bulky slab of black fur—moaned with anticipation. That filled the full respect Niko the kobold held for carnivorous creatures. He clambered carefully out of the darkness and growled, heave",
				" another shape had entered into the dark alleyway. Dark purple wings and claws immediately caught the beast's attention and quickly caught Niko's. Raising his scaly arms to trap his attacker, the shambling body of Skaff",
				" at a convenient height to get into the easy-to-overlook stalls in the window, were three small doors each covered with fine braiding of rope, masking each compartment within with fluff, causing the cleverest wardogars and",
				" four Pervugine by chance on guard. How cute! With their scary wyvern like bodyplates the miners treated the mouth with large spherical spots made from something inside their equipment like the stingers of some known poison; thereby instantly bringing life",
				" two rouges were holding fast to each side of the hunched torso of an obese body that collapsed in its shock at their unwelcome arrival.\n\n\n\n\"Holy\" arrived his whistling laugh followed by another high pitched whisper into Niko's ear",
				" another tall thin man strode in stealthily, snapping a dirty bit of clothing in a place as comfortable for a delicate observer to find as Niko's pocket. \"So that's him! He stole my supper too!",
				" watching, hidden by shadows cast by the fluttering black cloak, was Ellyssa Price, both longing and dread pressing her hands into her frightened palms as she mentally steeled herself for whatever death that Niph had come up with. The crowd began",
				" a roguish golden and brown zebra slinked and ambled closer, lumbering softly to the rhythm of his musing. A thick bang snapped and zarfeet/weard fragmented his body. While dropping his dull fluted",
				" three middle aged male filipinos confronted him. There were butchers here, butchers doing such a pitiful job that even sheep were held to higher standards. Their proud plumage never wore an odour of decay or death. Niko remembered"
			]
		},
		"top_k": {
			"0.5": [
				" Niko saw a large black dog with a white muzzle and a large black nose and ears. The animal was pacing back and forth, growling and snarling at the butcher. The butcher, a small man with a bald head and a bushy",
				" a man was staring at him intently. \"What are you doing out here?\" the man asked, his voice echoing through the alley. \"I was just leaving.\" Niko's tiny ears twitched in response to the man's question. He",
				" he saw a man in the alleyway.\n\n\"Hey! What are you doing here?\" Niko hissed, his voice echoing through the alleyway.\n\nThe man, a little shorter than Niko, was wearing a heavy cloak",
				" a large black cat with a white blaze on its chest and a white patch on its chest and a white patch on its chest and a white patch on its chest and a white patch on its chest and a white patch on its chest and a white patch",
				" a man in a black cloak was staring at him, and Niko knew he was under surveillance.\n\n\"I'm looking for a chicken,\" he said, keeping his voice low. \"I've got a chicken for sale.\"\n\nThe",
				" a dark haired girl was staring at the kobold with a very serious expression on her face.\n\n\"Excuse me, sir, I'm sorry to bother you,\" the girl said, her voice a little shaky. \"But I",
				" a large kobold with a long, pointed nose and a wide mouth was staring at him.\n\n\"You're trespassing on my property,\" the kobold said, his voice deep and rich, like a rich man's.\n",
				" a man dressed in a blue jacket and a pair of leather pants was staring at him.\n\n\"Hey, Niko, what are you doing here?\" the man asked.\n\nNiko slowly stood up and turned to face the man.",
				" was a man with a long, shaggy, matted beard. Niko's eyes narrowed as he saw the man's face, and he made a quick decision. He quickly stood up and ran forward, darting through the crowd until he",
				" a tall, dark figure was staring at him.\n\n\"What do you want?\" the butcher asked, his voice a deep rumbling.\n\nThe man was tall and lean, his long, black hair falling in thick waves to his shoulders"
			],
			"0.55": [
				" a tall, muscular man in a long black coat was swinging a meat cleaver in a wide arc.\n\n\"Hey!\" Niko's voice echoed through the alley. \"Hey, you! Stop!\"\n\nThe man did not notice the",
				" a young woman was staring at him with wide eyes.\n\n\"You're not supposed to be here,\" she said. \"You're not supposed to be here.\"\n\nNiko stepped forward and sniffed the air. \"I have a",
				" a boy with long black hair ran toward him. \"Hey, Niko!\" he exclaimed, his voice echoing in the alley. \"I've been looking all over for you! I was just about to go to the market to get some chicken for",
				" a young woman was staring at him.\n\nNiko slowly turned his head to look at the woman, his eyes narrowing as he took in her appearance. She was a beautiful young woman, even if he found her appearance somewhat disconcerting.",
				" was a very large and very angry unicorn.\n\n\"What are you doing here?\" said the unicorn.\n\n\"I'm just trying to find a chicken,\" said Niko.\n\n\"You're not supposed to be here,\" said",
				" there was a large, burly man, his face covered in a thick mop of white hair. Niko had seen this man before. He was the butcher's father.\n\n\"Niko!\" the butcher's father yelled in alarm,",
				" a small, fidgeting creature squatted on the ground.\n\n\"I can't believe you're doing this,\" said Niko.\n\n\"Why not?\" asked the little creature.\n\n\"Why not what?\" asked Niko",
				" was a woman in a dark green cloak. Her long black hair cascaded down her back, and she wore a long flowing white dress that was cut low in the front. She looked like she was about to start a fight, but instead she just",
				" a man in a black cloak stepped out of the shadows. He was tall, with a long, thin face and an intimidating, hawk-like nose. He was also very good looking, with a thin, boyish face and a kind smile.",
				" a tall, rotund man with a thick bushy beard and a thick pair of spectacles was staring at the kobold. His eyes were narrowed in an expression of disgust.\n\n\"What the hell do you think you're doing?\""
			],
			"0.6": [
				" a man in a black cloak stood with a dagger in his hand. Niko rose to his feet, his tail wagging furiously.\n\n\"I'm sorry, I didn't mean to scare you. I was just looking for my friend.\"",
				" was a large, muscular dwarf. He was dressed in a dark red cloak, and a small, pointed hat was pulled down over his eyes. The dwarf's large, muscular arms were wrapped around a chicken carcass, and he was staring intently",
				" he saw a tiny little man with a long, reddish-brown beard and a red cap.\n\nThe little man looked around curiously, then slowly walked towards the butcher, holding his hand out to him. The butcher took the hand and nodded",
				" Niko saw the young woman he had been following. She looked about ready to burst with excitement. The butcher had an arm around her waist and was leading her away into the back of his shop. Niko immediately knew what was going on. He",
				" a man in a black cloak with a hood pulled up over his head was watching him. The man was tall and muscled, with a bald head and a bushy beard that blended into the snow. His eyes were cold and distant, as if",
				" he could see a large rat, about the size of a cat, that had managed to squeeze its way through the hole the butcher had just created. The butcher was not paying much attention to his task as he continued to slice the chicken. Niko",
				" a large man with a thick mustache and a large bushy gray beard was staring at him.\n\n\"What are you doing here?\" Niko hissed as he stepped out of the shadows and into the light of the streetlamp.\n",
				" he saw the butcher's daughter, a small girl with long brown hair. She was staring at him intently, and the sight of her caused Niko's heart to beat faster.\n\nShe was a beautiful creature, he thought. Her dark",
				" he saw the butcher's wife. She was holding a baby and was feeding it from a bottle.\n\n\"You're late,\" she said.\n\n\"I'm sorry,\" said Niko.\n\n\"It's nothing. You're",
				" was a young man. Niko paused to study the newcomer. The butcher's apprentice was wearing a long, black coat, with a hood pulled up over his head. His face was pale and his eyes were red-rimmed, but he was"
			],
			"0.65": [
				" was a tall, well-dressed man with a broad back and a long, full beard. The man was dressed in a fine, dark green coat with a fur-lined hood, and he carried a large, sharp-looking sword at his",
				" a huge white wolf was glaring at him. Niko knew this wolf was a werewolf, but he had never seen one with his own eyes. He stood quietly, waiting for the butcher to turn around. He was just about to make his move",
				" a large, powerful man with a deadly looking axe was staring at Niko with a menacing expression. The butcher had dropped the chicken and was now staring in shock at the man with the axe.\n\n\"What the hell are you?�",
				" he saw a large, muscular man with a large, muscular, moustache. The man looked up at the noise and saw Niko, and he smiled.\n\n\"Ah, Niko, I have been waiting for you.\" The man",
				" a man in a long leather coat was inspecting the carcass. Niko stared at him for a moment, then turned and ran as fast as he could down the alley.\n\nThe butcher was almost finished with his work when Niko ran into",
				" the butcher's wife was looking at him with a wide smile. Niko watched the butcher's wife as she started to unbutton her blouse. She was a pretty woman, with brown hair and brown eyes, but her face was not as pretty",
				" a man was staring at him.\n\n\"Hey, Niko, you look like you need some help. I can't help you with your chicken, but I can help you with something else.\" The man spoke with a heavy accent, but",
				" a young man with a furrowed brow and a bemused expression on his face peered at Niko. The young man stood with his back to Niko, his arms crossed over his chest, a puzzled look on his face.\n",
				" was a man. The man was tall and lean, with a long, black beard and a pair of black eyes that were so close together that they seemed to be staring straight into Niko's soul. And then the man spoke.\n\n\"",
				" a young woman was staring at him with wide eyes.\n\n\"What are you doing?\" she asked.\n\n\"I'm looking for my chicken,\" Niko said, his voice wavering slightly.\n\n\"But I haven't"
			],
			"0.7": [
				" a large black dog was staring at him.\n\n\"Oh, you mean that dog?\" Niko hissed, stepping back from the butcher. \"He's mine. He belongs to the butcher, and he will eat me, and then I",
				" a short, thin man was staring at him.\n\n\"Niko, I have a question,\" said the man, a bit of a lisp to his voice.\n\nNiko jumped to his feet and ran to the man.\n",
				" a small black cat sat on the counter with a small basket of food. The cat looked up at Niko with a sad expression, as if he knew what Niko was doing was wrong.\n\n\"Come out, come out, wherever you",
				" he saw a heavy-set man with a long, drooping, white beard. The man was staring directly at Niko, who was standing still, his entire body frozen in place. The butcher was now standing on his stool, staring at the",
				" Niko saw a man step out of the shadows and begin to follow the butcher. He was tall and thin, with a long nose and a cold, calculating gaze.\n\n\"That's him!\" Niko hissed to himself.\n\n",
				" Niko could see a young woman with short, dark hair. She was wearing a long, flowing gown and a pair of high-heeled, black boots. Her dark eyes were bright, her mouth was smiling, and her body was lithe",
				" a tall, muscular man in a black cloak and a long white mask stood. The man lifted his right arm and pointed a finger at Niko, causing the kobold to jump back into the shadows. The man in the cloak laughed and pulled",
				" a small man with a long, thin nose and a long, thin, pointed beard stepped out from behind the butcher's stall. Niko leapt to his feet. He was almost too late. The man's large, flat, black eyes, his",
				" a young boy had been playing with a large knife. There was no way Niko could get past the boy without being noticed, so he quickly climbed the nearby wall and waited for the butcher to turn his attention back to his chicken. The butcher was",
				" a tall, slender man with a long, pointed nose and a pointed chin stood, his hood pulled up over his head.\n\n\"I am sorry to disturb you, but I need to speak to you about something important.\"\n\n\"My"
			],
			"0.75": [
				" a small, dark-haired boy was staring at Niko.\n\n\"Hey, you!\" the boy said, moving his head from side to side as if to see if Niko was real or not. \"What're you doing here?\"",
				" a large, black-haired man was staring at him.\n\n\"Hey, you!\" the man exclaimed, grabbing the kobold by the scruff of his neck. \"Get out of here, you little thief!\"\n\n\"I",
				" a small, dark-haired woman was staring at him with wide eyes.\n\n\"Oh, you're back,\" she said with a broad grin. \"I didn't know you were going to be gone so long.\"\n\n\"I had",
				" a young girl was staring at him.\n\n\"Oh, you've got company,\" she said, and then she smiled.\n\n\"I'm sorry, miss, but I don't have any chickens to sell.\"\n\n\"Really?\"",
				" he saw a man dressed in a suit and a red tie.\n\n\"You're late, you know,\" the man said as he approached. He was tall and slender, with a long, thin face, and his dark eyes were wide with",
				" a man was trying to pull the carcass free from the butcher's hands. Niko smiled. His prey was on his way.\n\n\"There you are, Niko,\" said the man, a young boy who had just finished his apprentices",
				" a huge, furry, long-limbed creature was staring at him.\n\nThe kobold was about to run, but the huge, furry, long-limbed creature suddenly turned, snarling, and charged at him. Niko",
				" a strange man was holding a small sack. Niko's eyes widened in surprise. The man's face was covered by a hood, but his eyes were visible, and they were quite disturbing. On his head was a strange hat, made from a",
				" a man in a red cloak was staring at the kobold. The man was tall, with a long, narrow face and bright, blue eyes. He was dressed in a long, black cloak and wore a red sash that was tied around",
				" a giant of a man with a thick black beard and a bulbous nose emerged from the shadows. Niko's eyes widened in fear as he recognized the man.\n\n\"I am the butcher,\" the man said as he eyed the small k"
			],
			"0.8": [
				" stood a young woman, her long red hair falling over her shoulders in a disheveled way. She was wearing a light blue dress with a white blouse underneath, and Niko was struck by the fact that she was wearing a pair of",
				" was a man.\n\n\"Hey, hey, kobold! What you doing?\" the man said, his voice muffled by the heavy cloak.\n\n\"Nothing, nothing,\" Niko said, trying to sound convincing.\n\n",
				" was a small, pudgy man, his face hidden by a thick fur cap, his hair completely white. Niko had never seen him before, but his presence was enough to tell Niko that this was indeed a kobold. He",
				" was a tall, muscular man with a bald head and a small scar running down the side of his face.\n\n\"What do you want?\" the man asked, holding up his hands to show that he was unarmed.\n\nNiko's",
				" a man was holding a knife to the throat of the chicken. Niko watched as the man brought the knife down, slicing through the neck of the chicken and then dropping the bloody knife to the ground. Niko lifted his head slightly as he saw",
				" a large, muscular man was staring at him with a sneer on his face. Niko knew that look. The man was looking for trouble.\n\n\"Hey, Niko, what's up?\" asked the man.\n\nNiko",
				" a small figure was holding her hand over her mouth.\n\n\"Oh, dear,\" she said, and then she looked up at Niko. \"Oh, dear. What are you doing here?\"\n\n\"I'm looking for a chicken",
				" a man dressed in a black leather coat and a red scarf was looking at him. The man held a large knife in his hand, and Niko tensed in anticipation of a fight.\n\n\"You're late,\" the man said.\n",
				" a small red-haired girl was holding the carcass aloft. Niko lifted his nose in the air and sniffed the air. The scent of blood was unmistakable. His tail began to wag as he trotted toward the girl.",
				" a man was looking at him. He was a middle-aged man with a round face and a large nose. He was wearing a brown leather coat and a black leather hat. His face was pock-marked and his eyes were small and dark"
			],
			"0.85": [
				" a small, rat-like creature was staring at him.\n\n\"What are you doing here?\"\n\n\"I was just looking for a chicken,\" said Niko. \"I haven't seen any.\"\n\n\"You are a k",
				" a large man with a long beard and a thick moustache was standing with his arms folded across his chest. He was a short man with a thick neck and a barrel chest. His eyes were cold and his face was hard as stone.\n",
				" a large and intimidatingly muscular man with a thick neck and a bald head stood glaring at him.\n\n\"What do you think you're doing?\" he growled.\n\n\"I'm just looking for a chicken,\" said Niko.",
				" a large man with a beak of a nose was staring down at him.\n\n\"Hey, kid,\" the man said, \"why don't you just go back to where you came from?\"\n\nNiko was not intimidated by the",
				" a pale, slender girl with long, black hair and a small, delicate figure was staring at him. She wore a red scarf around her neck and a woolen hat on her head. Niko's eyes narrowed as he considered the girl. She",
				" was a small girl of about five years of age. She was wearing a bright orange dress that had a large silver buckle on the front. She looked up at Niko with wide eyes and a shy smile. Niko smiled back at her, making",
				" a large man was staring at Niko with a scowl.\n\n\"What are you doing?\" the man demanded.\n\n\"I'm looking for a chicken,\" Niko said.\n\n\"You can't have one,\" the man",
				" another kobold was fumbling with something in his pocket. A second later, the butcher turned and saw Niko standing in front of him.\n\n\"Hey, what are you doing here?\" he asked.\n\nThe kobold",
				" a large, shaggy dog was sniffing around the butcher's side of the stall. The dog's large, yellow eyes were fixed on the butcher with a look of expectation.\n\n\"Hey, you, what's your problem?\" asked",
				" was a woman.\n\n\"Excuse me,\" she said, taking a step backward. \"I saw you there. I thought you were a thief. I thought you were a thief.\"\n\n\"I'm not a thief,\" Niko"
			],
			"0.9": [
				" a large, dark-haired woman was staring at him.\n\n\"Where did you come from?\" she asked, her voice filled with curiosity.\n\nNiko was startled by the woman's voice and the sudden realization that he was standing in",
				" a large, dark-haired man was making a show of looking around, trying to see if anyone was watching. The man was dressed in a fine, silky white robe, and he carried a large, ornate sword in his right hand.",
				" he saw a large, dark shape standing on the other side. This was a guard. He was a tall, muscular man with a long, black beard and a short, black cape that hung over his shoulder. He was staring at Niko with",
				" a tall man in a black cloak stood, his back to Niko. The man's dark, hooded cloak hid his face, but Niko could see his eyes, which were red and bulging with anger.\n\n\"You're not",
				" was a black-haired man with a scar on his cheek. Niko was surprised to see a man with such a scar, but then again, he was a kobold and this man was a stranger.\n\n\"Good afternoon,",
				" a very tall man with a long, pointy nose and a thick mustache stood staring at him.\n\n\"Niko?\" the man asked, his voice deep and raspy. \"Is that you?\"\n\nNiko hopped up onto",
				" a large man with a thick beard and a long black coat stood with his hands on his hips. The man's eyes were fixed on the chicken, which was now hanging from his hand by a thread. The man was looking at the butcher as though",
				" a boy of about five years old was staring at him. Niko recognized him as the child who had been with the butcher earlier. The little boy was staring at him with a look of awe on his face. \"Niko, you must come",
				" the kobold saw a small black dog bounding toward Niko. The dog stopped about twenty feet away and sniffed at the kobold.\n\n\"Hello, little friend,\" said Niko.\n\nThe dog looked at him",
				" a man in a black cloak was staring at him.\n\n\"You're not a kobold, are you?\" he asked in a low, menacing voice.\n\n\"I am a kobold,\" Niko replied.\n\n"
			],
			"0.95": [
				" a young woman with long black hair and a large nose for a nose stood watching him. She was wearing a dark brown cloak that was pulled up over her head and a dark green scarf that was wrapped around her neck. She was clearly a woman of",
				" a man with a red beard and a cold, dead look in his eyes was watching Niko with a look of pure hatred.\n\n\"Well, well, well,\" the man said, his voice echoing in the cold air. \"If it",
				" a large man in a black cloak was staring at him with a mixture of curiosity and disdain. Niko could only assume that the man was the butcher, but then he remembered that he was just a lowly kobold.\n\n\"You are",
				" a large man with a long, pointed nose and a face like a wrinkled walnut was staring at him. Niko's heart skipped a beat as he realized that the man was staring at him.\n\n\"What are you doing here?\"",
				" a small woman, a little older than the butcher, was staring at him.\n\n\"A little late for a chicken, isn't it?\" she asked.\n\n\"I was just about to take it home,\" Niko replied. \"",
				" a small group of men were staring at him. One of them was a man with a bushy black beard and a patch over one eye. The other man was a fat, balding fellow with a long nose and a constant smile on his face",
				" a man was standing. Niko's eyes darted around the alley, searching for the man, but he couldn't see him. The man was looking directly at him. Niko's eyes darted around the alley again, searching for the man",
				" Niko saw a young woman in a long, black cloak and hood. The woman looked around her, and then, with a quick, almost furtive movement, she darted between the butcher and the chicken.\n\nNiko watched in",
				" a very large man was staring at him.\n\n\"Hey, Niko!\" the man called out. \"What you doing here?\"\n\n\"I'm looking for my chicken,\" Niko said. \"I don't like the way it",
				" the kobold saw a line of three men walking toward him.\n\n\"Well, now,\" one of the men said, \"you're going to have to be more careful. We've got a bounty on your head.\"\n\nN"
			],
			"1.0": [
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and",
				" a large, muscular man with a thick beard and a long, black cloak stood. The man was tall and broad shouldered, with a thick neck and a thick, muscular chest. His face was covered in a thick layer of stubble, and"
			]
		},
		"rep_pen": {
			"1.0": [
				" a large hooded figure was staring at the kobold.\n\n\"What are you doing?\" the figure asked.\n\n\"I'm taking this chicken to the butcher,\" Niko replied. \"You shouldn't be here.\"\n\n",
				" he saw a familiar figure.\n\n\"It's not fair!\" Niko growled at the man. \"You have to do everything for me and then expect me to do everything for you!\"\n\n\"You're right, you're right",
				" a small, dark-haired boy was staring at him.\n\n\"Leave me alone!\" Niko hissed, his voice echoing in the alleyway.\n\n\"I'm not going to hurt you,\" the boy replied in a gentle voice",
				" a tall, well-muscled man with a silver-blond beard and a large scar on his forehead stood with his hands on his hips.\n\n\"What do you want?\" Niko hissed, his voice low and menacing.\n",
				" a large, scaly creature was staring at him.\n\n\"Hello, Niko,\" the creature said, his voice deep and rough. \"I am the kobold of the city of St. Petersburg. I have come to steal your",
				" a large, burly man in a fur-lined cloak was staring directly at him. Niko froze in place, his small eyes darting from side to side in an attempt to locate the source of the sound.\n\n\"What the hell",
				" a man was looking up at him with a large knife in his hand.\n\n\"What do you want, you little twit?\" the man said in a thick accent.\n\n\"I want to eat your chicken.\"\n\n\"I",
				" was a tall, muscular man with a dark, arrogant expression on his face. Niko froze, unable to move a muscle, not knowing what to do. The man was looking directly at him, his eyes wide with surprise. He had seen him",
				" a young man with a broad face and a shock of brown hair was staring at him.\n\n\"What are you doing here?\" The young man's voice was low, but Niko knew that he was not speaking to the butcher.\n\n",
				" the kobold was startled to see a familiar figure, a man with a long, flowing black cloak and a round face.\n\n\"Hello, Niko,\" said the man. \"What are you doing here?\"\n\n\"I'm"
			],
			"1.05": [
				" Niko saw a small gray cat peering into the butcher's stall. The cat had a green-and-white-striped tabby cat face with a white-tipped tail and a black-and-white striped belly. The cat",
				" a dark-haired man in a leather jacket and tall leather boots stood, staring at the kobold with a look of intense hatred.\n\n\"I have a question for you,\" Niko said. The butcher looked at Niko with a",
				" stood a young woman with a small boy.\n\nThe butcher turned around, his eyes wide with fear. \"What do you want?\" he asked, his voice hoarse with fear.\n\n\"I need to get my chicken,\" the boy",
				" a short, fat man was staring at him. The man's face was as red as a lobster's and his eyes were bulging out of his head. Niko stood still and waited for him to speak. The man was obviously drunk and he",
				" a large woman was staring at him. Niko didn't know her, but the woman looked familiar.\n\n\"You're the kobold who stole my chicken,\" the woman said, her voice carrying to Niko's ears.\n\n",
				" a short, stout man with a bushy beard and a bushy mustache was holding a large hunting knife.\n\n\"Are you ready, Niko?\" asked the man with a knowing smile. \"I have a special treat for you. I",
				" a dark-haired man was staring at him. The man was tall and lean, with a long, lean nose and a pointed chin. He wore a long black coat and a black hat with a feather stuck in the band. He was holding a",
				" a small man in a black cloak was staring at him.\n\n\"Hey, you!\" the man called out. \"What are you doing here?\"\n\n\"I'm looking for some food,\" Niko said, his voice soft and quiet",
				" Niko saw a large, burly man with a grizzled beard and a black eye. The man looked up and down the street, then turned to look at Niko.\n\n\"Hey, you!\" he called out, his voice echoing",
				" he watched in awe as the man turned and walked away.\n\nThe butcher stopped and looked back at Niko, his eyes darting around the alley, looking for something. Niko edged closer to the butcher, ready to spring. The butcher"
			],
			"1.1": [
				" a tall man with a red beard and a crooked nose was holding a long knife in his hand.\n\n\"Who are you?\" Niko growled, his voice echoing throughout the alley.\n\n\"I am the butcher,\" the man said",
				" a young man in the shabby clothes of a city dweller was looking down at him with a sneer.\n\n\"I'm not stealing anything,\" the kobold said, his voice a low growl.\n\n\"Then what",
				" a man with a long, thin nose and a pointed chin was staring at him.\n\n\"Well, well,\" Niko said. \"It seems you've finally come to your senses.\"\n\n\"I'm the last person you want to",
				" was a tall man with dark hair and a thick beard. Niko's eyes widened in surprise as he realized that the man was the butcher. The man moved to the side and began to cut the chicken at a different angle, leaving the breast half",
				" Niko saw a small, shivering fox dart from the shadows and race for the butcher's stall.\n\n\"I'm going to be late for my date,\" the butcher said, grabbing a chicken leg from the cutting board.\n\nN",
				" a woman with a beautiful face and long flowing red hair was staring at him.\n\n\"What are you doing?\" she demanded. \"You're not supposed to be in here. This is a public market.\"\n\n\"I'm a k",
				" a young woman was staring at Niko with wide eyes and a wide smile.\n\n\"I'll take that chicken,\" she said, holding out her hand to him.\n\n\"I'm not stealing it,\" Niko said, holding up",
				" a large black-haired man with a long scar that ran down the side of his face and across his cheek was staring at Niko. He was dressed in a black cloak that hung from his shoulders and was tied with a black scarf. A leather",
				" a large man with a long face and a thick mustache stood, a large knife in his hand. Niko waited patiently as the man leaned over the butcher and looked at the chicken.\n\n\"Hmmm,\" he said, \"I don't",
				" was a large, burly man.\n\n\"Hey, where'd you come from?\" the man asked in a deep voice. \"I thought you were lost.\"\n\n\"Oh, I'm just passing through,\" Niko replied. \""
			],
			"1.15": [
				" was a man in the same clothes as the butcher, with a small sack on his shoulder. The sack was empty.\n\nNiko sniffed the air and his sharp canine nose picked up the faint smell of fresh meat. He pushed forward,",
				" a large black-bearded man in a dark leather coat and fur-trimmed hat was staring at the kobold.\n\n\"You're late,\" the man said with a grin. \"I was expecting you any moment.\"\n",
				" he saw a familiar face. The tall, lean man, the one who had been standing at the front of the butcher shop, had just entered the alley.\n\n\"What are you looking at?\" The man, who was carrying a large butcher",
				" a man was staring at him. Niko had seen the man before, but he had never been able to place him.\n\n\"Hey! Who are you?\" the man asked.\n\n\"I'm Niko, and I'm looking",
				" a large man was glaring at him. Niko's heart sank. It was the butcher's brother. He had just finished cutting his chicken, and was now glaring at Niko. Niko had been caught.\n\n\"Hey!\" Niko",
				" with a frying pan in hand, was a tough-looking woman, her face hidden behind a thick veil. Niko's instincts told him that she was a witch. He had never seen one before, but he knew that they were a common sight",
				" a large black cat was staring at him. Niko's eyes narrowed as he recognized the cat from the alley. It was the same cat he had seen in the shadows earlier, the one who had spoken to him.\n\n\"I am not",
				" a brawny man with a fierce face was staring at him.\n\n\"What are you doing here?\" Niko asked, his voice low and menacing.\n\n\"I was just passing by,\" the brawny man said, \"",
				" was a tall, thin man with a long, straight nose and a pointed chin.\n\n\"Well, well, well, what have we here?\" Niko said, his voice buzzing with excitement. \"A rare specimen of the rare breed!\"",
				" a large black and white wolf with a brown and white coat was staring at him. The wolf had a large head and a long muzzle and a thick tail that was curled around her body. She was a very large wolf, at least as large as"
			],
			"1.2": [
				" a man was watching him. He was tall, with long black hair and a thin, pale face. His eyes were cold and his expression was one of complete boredom.\n\n\"You are the one who killed my father,\" the man said,",
				" a large man with a beard and a long, thick nose appeared.\n\n\"Hey there, little kobold,\" he said, his voice booming throughout the alley. \"What are you doing here?\"\n\n\"I'm looking for a",
				" a man was looking down at the carcass.\n\n\"What's wrong?\" asked Niko.\n\n\"Nothing,\" said the man. \"I thought I heard something.\"\n\n\"What?\" asked Niko.\n\n\"I",
				" he saw a large shadow moving. The shadow was large because it was a man, but it was also large because its owner was a dwarf with a long, pointed, pointed nose and the most fearsome of eyes.\n\n\"What do you want",
				" a man was staring at him. Niko's heart skipped a beat. The man was wearing a hooded cloak and carrying a small, large knife. The fact that he was carrying a knife was a good sign. Niko would be able to",
				" a young woman was staring at him.\n\n\"What are you doing here?\" she asked, her voice carrying a hint of amusement.\n\n\"I'm looking for a chicken,\" Niko replied. \"And I need to get out of",
				" a man was holding his hands up. The man seemed to be in shock, but as he turned to face the kobold, Niko knew that he had been the target of this attack. The man was a human, and clearly had been",
				" a man was watching him.\n\n\"What are you doing?\" the man asked in a deep voice.\n\nNiko stood up and stretched his arms out to his sides. \"I'm looking for the chicken.\"\n\n\"You can",
				" a woman with a long red braid around her neck was staring at Niko. She was tall, with a long, narrow face that was made even more prominent by her braided braid. Her eyes were dark, and her lips were purs",
				" two men were arguing.\n\n\"I don't care what you say,\" one of the men in the argument said, his voice rising with each word. \"I am not going to pay for it.\"\n\n\"I'm not paying for"
			],
			"1.25": [
				" a large man with a long, blond beard and a sly smile was watching him.\n\n\"Niko!\" he called, \"come here, boy!\"\n\nNiko darted into the alley, his tail twitching with excitement. He",
				" he saw an old woman holding a large cooking pot filled with water. The woman nodded, and Niko the kobold stepped forward and quietly took the chicken from her.\n\n\"Thank you,\" said Niko. \"I am Niko",
				" was a tall man, his face obscured by a cloak. Niko could see the man's eyes, narrow and pale, peering at him from beneath the hood of his cloak.\n\n\"I am here to kill you,\" Niko his",
				" a large wolf stood with its back to Niko, and its muzzle was dripping with blood.\n\nNiko looked around for another way to get the chicken without being seen, but there wasn't one. The butcher was still cutting, and the",
				" was an elderly man. Niko's heart skipped a beat.\n\n\"Ah, hello. Do you know where I can find the chicken?\"\n\nThe elderly man stared at Niko with a puzzled look on his face.\n\n\"",
				" a small, scruffy man with a wild shock of red hair was staring at Niko.\n\n\"Hey, little buddy,\" the man said, his voice high and slightly squeaky. \"What are you doing here?\"\n\nN",
				" two men were looking at him. Niko was about to make his escape when one of the men, a short man with a thick beard, said, \"Careful, you'll get caught.\"\n\nNiko's eyes widened in surprise.",
				" Niko was surprised to see a large man staring at him.\n\n\"Hey, you!\" The stranger called out. \"What are you doing here?\"\n\n\"I'm looking for the chicken,\" Niko replied.\n\n\"What",
				" a large, dirty-faced man was staring at him.\n\nNiko's head snapped up to the man's face. \"What?\" he whispered.\n\nThe man was dressed in rags, but he had a powerful and commanding presence",
				" a very large and muscular man with a thick black beard and long, bright red hair was staring at Niko with a very puzzled look on his face.\n\n\"What are you doing here?\" asked the man.\n\n\"I'm a"
			],
			"1.3": [
				" Niko saw a small brown-haired woman in her early twenties. Her skin was pale and her eyes were large and round like a cat's. Her short, neat blond hair was tied back in a tight bun. She was wearing a plain dark",
				" Niko saw a dark figure dart out from behind the stall. Using his short tail to guide him, Niko crept up to the dark figure and peered through the holes in the cloak. The figure turned and saw Niko, and it was",
				" he saw that he had been successful in his task.\n\n\" _Shh!_ \" he whispered to himself, hoping the butcher would not hear him.\n\nThe butcher turned to look at Niko and he saw the butcher's eyes",
				" a small man was trying to steal a chicken.\n\n\"Hey! Watch what you're doing!\" Niko hissed, his voice carrying easily through the cold air. The thief turned around and saw Niko approaching. \"You're a k",
				" a young boy with a short, dark brown beard was struggling to gain purchase on the slippery cobblestone. The boy's arms were flailing wildly, and he was only just managing to hold on to the chicken. The butcher was nowhere to be",
				" was a tall man with a trimmed beard and a long, white coat. He was holding a knife in one hand and a small wooden box in the other. The butcher had been too busy to notice the man who had just entered the alley.\n",
				" a man stood, his face covered in blood.\n\n\"Who did this?\" the man growled, his voice shaking with anger.\n\n\"I'll have your head for this,\" the butcher said, pointing his knife at the man.",
				" a large black cat appeared. Niko froze in place, awaiting the inevitable attack. The cat made no move to attack Niko, instead it watched him with a dark, hooded gaze. Niko slowly backed up until he was standing between the",
				" a hooded man wearing a dark cloak stepped out. The man looked around him, his eyes taking in the alley, then he turned and walked away. Niko quickly followed him, but when he tried to cross the street he was stopped by a",
				" a large black cat strode towards him.\n\n\"Hey there, little kitty,\" he said. \"What are you doing?\"\n\n\"You're not going to steal my chicken, are you?\" the cat said, his voice filled"
			]
		}
	}
}